{"title": "Microsoft appeals UK veto of Activision Blizzard takeover", "body": ["Microsoft is legally challenging the UK competition regulator's decision to block its $69bn (£55bn) takeover of video games giant Activision Blizzard.", "The UK's Competition and Markets Authority (CMA) surprise decision last month was seen to have seriously diminished the tech firm's ambitions.", "The Xbox-maker claims consumers and competition won't be hurt by the deal.", "Global regulators are split in their opinion; 37 other countries including Japan and Ukraine have approved it.", "Microsoft has already received the green light from China, the world's biggest gaming market, and from the European Commission (EC).", "\"China's unconditional clearance of our acquisition of Activision Blizzard follows clearance decisions from jurisdictions such as the European Union and Japan, bringing the total to 37 countries representing more than two billion people,\" a Microsoft spokesperson emailed in a statement. ", "\"The acquisition combined with our recent commitments to the European Commission will empower consumers worldwide to play more games on more devices.\"", "Following the EC's approval, CMA chief executive Sarah Cardell said the regulator stood by its decision. ", "\"Microsoft's proposals, accepted by the European Commission today, would allow Microsoft to set the terms and conditions for this market for the next 10 years,\" she said.", "In order for the deal to go through, Microsoft and Activision need approval from regulatory bodies in the UK, EU and the US.", "However the deal still faces significant hurdles from the US Federal Trade Commission (FTC) over concerns the proposed deal violates anti-trust law.", "The FTC filed a lawsuit in December to block the deal and a trial has been set for later this year.", "Microsoft recently won a legal reprieve in California after a US judge dismissed a private lawsuit brought by a group of video gamers aimed at blocking the deal.", "The San Francisco federal court said the gamers had not shown they would be \"irreparably harmed\" if the Microsoft-Activision Blizzard merger were allowed to proceed. ", "The plaintiffs were concerned that the availability of current versions of highly popular titles such as Call of Duty will become limited following the Activision Blizzard planned merger. They plan to appeal."]}