{"title": "Virgin Orbit: Branson’s rocket dream ends after mission failure", "body": ["Sir Richard Branson's rocket company Virgin Orbit has shut down, just months after a major mission failure.", "It comes weeks after the firm set up to launch satellites paused operations to try and boost its finances.", "It had been selling off items it owns in a bid to survive, including its converted jet Cosmic Girl, and most of its headquarters in California.  ", "In January, its first ever satellite mission in the UK reached space, but fell short of its target orbit.", "The mission was billed as a milestone for UK space exploration. ", "It had been hoped the launch, called Start Me Up after the 1981 Rolling Stones hit, would turn the country into a global player - from manufacturing satellites to building rockets and creating new spaceports.", "But the rocket experienced an anomaly which \"prematurely ended\" the first burn and Sir Richard's space dream was all but over. ", "Two months later the company \"paused all operations\" in an apparent attempt to shore up its finances and almost all employees were laid off.", "It has been a tumultuous period for the Virgin boss. ", "Earlier this month, Sir Richard told the BBC  that he had personally lost around £1.5bn during the pandemic after lockdowns hit his airline and leisure businesses. ", "\"There was a time when I thought we were going to lose everything\", he said. However, he has managed to retain his billionaire status - he has a net worth of £2.4bn according to the latest Sunday Times Rich List. ", "When it became clear Virgin Orbit was unable to secure long-term funding, it filed for bankruptcy protection in the US early last month. ", "Rival start-up Rocket Lab has bought most of Virgin Orbit's headquarters in California as well as other assets. The company's Boeing 747 plane, which was converted to help launch satellites, has also been sold off. In total, the asset sale fetched $36.4m (£29.4m).", "Virgin Orbit, which was founded in 2017, never made a profit as a public company.", "So much was riding on Virgin Orbit's rocket launch from Cornwall in January, it was supposed to be a spectacular start to a new industry in the UK.", "But the dislodging of a small component - a fuel filter - had a domino effect. The rocket failed, confidence was lost in Virgin Orbit and now the company has been sold off, piecemeal. ", "Where does this leave Spaceport Cornwall, the UK's first licensed spaceport? US-based Virgin Orbit was their key customer.   ", "The Cornwall team there say they're working with other launch companies, including Sierra Space, and they'll continue to create and grow a space cluster in the South West. ", "But another Cornwall blast off is unlikely to happen anytime soon. The site at Newquay Airport is limited to horizontal launches - where a plane takes off, carrying a rocket, which is then launched mid-flight.  ", "Other sites around the UK have their sights set on space too. SaxaVord Spaceport, based on the Shetland island of Unst, is now leading the way.", "This is a vertical launch site where rockets blast off skywards from a pad. SaxaVord is working with several firms, including a German company called Rocket Factory Augsburg - engine testing is set to take place in Shetland later this year.", "And it's not the only spaceport to be based in Scotland. Others are planned in Sutherland in the Highlands and Benbecula in the Outer Hebrides.", "The demise of Virgin Orbit shows just how hard this race to space can be - and there may well be more failures along the way. But the UK's ambitions for space are far from over.  ", "A UK Space Agency spokesperson said the UK space sector was thriving and generating an income of £17.5bn a year, employing around 49,000 people. ", "It said its focus remained on supporting multiple projects designed to make the UK the \"leading provider of commercial small satellite launch in Europe by 2030\"."]}