{"title": "Chip war: Apple strikes major US-made semiconductor deal", "body": ["Apple says it has struck a multi-billion dollar deal with chipmaker Broadcom to use more US-made parts.", "Under the multi-year agreement, the two US companies will develop components for 5G devices that will be designed and manufactured in America.", "Apple says the deal is part of a plan it announced in 2021 to invest $430bn (£346bn) in the US economy.", "The move comes as a trade row centred on the technology industry intensifies between Washington and Beijing.", "The long-running dispute has seen the US impose a series of measures against China's chip making industry and invest billions of dollars to boost America's semiconductor sector.", "In recent months, US tech giants have come under increased scrutiny from both Democrat and Republican lawmakers over their reliance on Chinese manufacturers and components.", "Apple has been gradually diversifying its supply chains, with more of its devices now made in countries like India and Vietnam.", "Last year, it said that it will buy semiconductors from a factory being built in the US state of Arizona by Taiwanese chipmaking giant TSMC.", "In 2022, Apple also announced plans to make the iPhone 14 in India, a significant milestone in the company's strategy to diversify manufacturing outside of China.", "The move expanded the company's Indian manufacturing operations - it has been making iPhones in the southern state of Tamil Nadu since 2017.", "Last month, Apple launched its first Indian retail stores - in the financial hub Mumbai and the country's capital Delhi.", "Under the latest deal, which expands the iPhone maker's existing relationship with Broadcom, components for Apple devices will be designed and built in Colorado and other parts of the US.", "\"We're thrilled to make commitments that harness the ingenuity, creativity, and innovative spirit of American manufacturing,\" Apple's chief executive Tim Cook said in a statement.", "Tensions between the US and China have escalated in recent months.", "Earlier this week, China said products made by US memory chip giant Micron Technology were a national security risk, in Beijing's first major move against a US chip maker.", "The country's cyberspace regulator announced on Sunday that America's biggest maker of memory chips poses \"serious network security risks\"."]}