{"title": "ChatGPT: Can China overtake the US in the AI marathon?", "body": ["Artificial intelligence has emerged as enough of a concern that it made it onto what was already a packed agenda at the G7 summit at the weekend.", "Concerns about AI's harmful impact coincide with the US' attempts to restrict China's access to crucial technology.", "For now, the US seems to be ahead in the AI race. And there is already the possibility that current restrictions on semiconductor exports to China could hamper Beijing's technological progress.", "But China could catch up, according to analysts, as AI solutions take years to be perfected. Chinese internet companies \"are arguably more advanced than US internet companies, depending on how you're measuring advancement,\" Kendra Schaefer, head of tech policy research at Trivium China tells the BBC.", "However, she says China's \"ability to manufacture high-end equipment and components is an estimated 10 to 15 years behind global leaders.\"", "The US' biggest advantage is Silicon Valley, arguably the world's supreme entrepreneurial hotspot. It is the birthplace of technology giants such as Google, Apple and Intel that have helped shape modern life.", "Innovators in the country have been helped by its unique research culture, says Pascale Fung, director of the Center for Artificial Intelligence Research at the Hong Kong University of Science and Technology.", "Researchers often spend years working to improve a technology without a product in mind, Ms Fung says.", "OpenAI, for example, operated as a non-profit company for years as it researched the Transformers machine learning model, which eventually powered ChatGPT.", "\"This environment never existed in most Chinese companies. They would build deep learning systems or large language models only after they saw the popularity,\" she adds. \"This is a fundamental challenge to Chinese AI.\"", "US investors have also been supportive of the country's research push. In 2019, Microsoft said it would put $1bn (£810,000) in to OpenAI.", "\"AI is one of the most transformative technologies of our time and has the potential to help solve many of our world's most pressing challenges,\" Microsoft chief executive Satya Nadella said.", "China, meanwhile, benefits from a larger consumer base. It is the world's second-most populous country, home to roughly 1.4 billion people.", "It also has a thriving internet sector, says Edith Yeung, a partner at the Race Capital investment firm.", "Nearly everyone in the country uses the super app WeChat, for example. It is used for almost everything from sending text messages, to booking doctor's appointments and filing taxes.", "As a result, there's a wealth of information that can be used to improve products. \"The AI model is going to be only as good as the data that is available for it to learn from,\" Ms Yeung says.", "\"For good or bad, China has a lot less rules around privacy, and a lot more data [compared to the US]. There's CCTV facial recognition everywhere, for example,\" she adds. \"Imagine how useful that would be for AI-generated images.\"", "While China's tech community may appear to be lagging behind the US, its developers have an edge, according to Lee Kai-Fu, who makes the argument in his book AI Superpowers: China, Silicon Valley, and the New World Order.", "\"They live in a world where speed is essential, copying is an accepted practice, and competitors will stop at nothing to win a new market,\" wrote Mr Lee, a prominent figure in Beijing's internet sector and the former head of Google China.", "\"This rough-and-tumble environment makes a strong contrast to Silicon Valley, where copying is stigmatised and many companies are allowed to coast on the basis of one original idea or lucky break.\"", "China's copycat era has its problems, including serious issues around intellectual property. Mr Lee writes that it has led to a generation of hardy and nimble entrepreneurs ready to compete.", "Since the 1980s, China has been expanding its economy, which used to be based mainly on manufacturing, to one that is technology-based, Ms Fung says.", "\"In the last decade, we have seen more innovation from Chinese consumer-driven internet companies and high-end Chinese designs,\" she adds.", "While Chinese tech companies certainly have unique advantages, the full impact of Beijing's authoritarianism is still unclear.", "There are questions, for instance, about whether censorship would affect development of Chinese AI chatbots. Will they be able to answer sensitive questions about President Xi Jinping?", "\"I don't think anyone in China will ask controversial questions on Baidu or Ernie in the first place. They know it's censored,\" Ms Yeung says. \"Sensitive topics are a very small part of the usage [of chatbots]. They just get more media attention,\" Ms Fung adds.", "The bigger concern is that US attempts to restrict China's access to specialised tech can stymie the latter's AI industry.", "High-performing computer chips, or semiconductors, are now the source of much tension between Washington and Beijing. They are used in everyday products including laptops and smartphones, and could have military applications. They are also crucial to the hardware required for AI learning.", "US companies like Nvidia currently have the lead in developing AI chips and \"few [Chinese] companies can compete against ChatGPT\" given export restrictions, Ms Fung says.", "While this will hit China's high-tech industries like cutting edge AI, it won't affect the production of consumer technology, such as mobiles and laptops. This is because \"the export controls are designed to prevent China from developing advanced AI for military purposes,\" Ms Schaefer says.", "To overcome this, China needs its own Silicon Valley - a research culture that attracts talent from diverse backgrounds, Ms Fung says.", "\"So far it has relied on both domestic talent and those from overseas with Chinese heritage. There is a limit to homogeneous cultural thinking,\" she adds.", "Beijing has been trying to close the gap through its \"Big Fund\", which offers massive incentives to chip companies.", "But it has also tightened its grip on the sector. In March, Zhao Weiguo became the latest technology tycoon to be accused of corruption by authorities.", "Beijing's focus on certain industries can bring financial incentives and loosen red tape, but it may also mean greater scrutiny, and more fear and uncertainty.", "\"Zhao's arrest is a message for other state-owned firms: don't mess around with state money, particularly in the chip space,\" Ms Schaefer says. \"Now it's time to get on with the job.\"", "How that message will affect the future of China's AI industry remains to be seen."]}