{"title": "Prime: Caffeine warnings should be clearer, says expert", "body": ["Concerns have been raised that Prime Energy drinks don't display caffeine warnings clearly enough to show they are unsuitable for children.", "It has been claimed the packaging on caffeinated and non-caffeinated versions of Prime is too similar.", "Prime Energy contains as much caffeine as two cups of coffee - unlike Prime Hydrate, which contains no caffeine.", "Prime, which has been promoted by YouTubers KSI and Logan Paul, has been contacted for comment.", "Earlier in May, Milton Primary School in Newport sent a text to parents warning them not to confuse the two drinks after a pupil fell ill outside of school hours.", "The UK launch of Prime Hydrate in early 2022 prompted long queues, grappling shoppers, and even headfirst dives into supermarket shelves.", "KSI and Paul - who have over 40 million YouTube followers between them - then helped launch the energy drink version of Prime in the UK earlier this year.", "Prime Energy contains 140mg of caffeine per can, which is the equivalent of two cups of coffee or a double espresso.", "A warning in the lower section on the back of a can states that the drink is not recommended for children under the age of 18, women who are pregnant or nursing, or individuals who are sensitive to caffeine.", "Aisling Pigott, a dietician based in Cardiff, said: \"We know that high intakes of caffeine are not recommended for children and young people.", "\"There are various guidelines around safe intakes, which is usually around 3mg of caffeine per kilogram of body weight. So for most children, a can of Prime Energy would exceed 'safe' intake.", "She said studies on adults exceeding safe intake resulted in reduced concentration affecting sleep, and an impact on how the heart functions.", "Meanwhile, Dr Prabirendra Chatterjee, a lecturer in marketing at Cardiff University, said he believed Prime Energy should have its caffeine warning prominently on the front of the can.", "He also said his opinion was the design of the two products were very similar.", "\"You need to specifically mention that this contains some dose of caffeine and clearly mention that this is not suitable for children, some adults with medical conditions and pregnant women,\" he said. ", "\"This information must be placed at the front in a very prominent manner. You just don't put this on the back along with other information like calories, nutrition and all that.", "\"For any energy drink you need to mention that it contains caffeine, and help the consumer from differentiating one product to another.\"", "But Dr Chatterjee said there is no legal requirement for Prime to make its caffeine labelling more prominent.", "\"There is no strict law here, it's just a recommendation. But ethically speaking, if you go by the advice coming from regulators, there should be some information at the front,\" he said.", "Can members of the public tell the difference?", "James Mayley, 31, said: \"The one in the can is more likely to be an energy drink, so I would assume higher in caffeine. ", "\"I would assume the other one is an isotonic drink, but I don't know definitely.\"", "Anita O'Leary and Cathy Phillips, both 70, said they could not tell the difference between the two drinks.", "\"Not really, apart from one's in a can and one's in a bottle,\" said Anita.", "\"They've both got lemon and lime. I can't see any other difference.\"", "Dr Chatterjee said Prime could make changes to make the difference between the two products clearer.", "\"They should put some health information on the front, just to make sure that consumers who are choosing it know that it is an energy drink,\" he said.", "\"The general advice is that you shouldn't put that important information at the very back, because most of the consumers don't read it. ", "\"Just think about a child, even if they see it's an energy drink, they might not be aware of what it is exactly. ", "\"In terms of the product design, they can differentiate and some of the market leaders have been doing this. ", "\"It shouldn't be a big problem. Even from a marketing and branding perspective bringing some changes in the design for the energy drink is advisable, that wouldn't affect the marketer in any adverse way.\"", "The BBC has contacted Prime for comment."]}