{"title": "Douyin: Chinese livestreamer dies after filming drinking video", "body": ["A Chinese livestreamer has died shortly after he was seen drinking excessive amounts of alcohol on Douyin, China's version of TikTok.", "User Brother Three Thousand drank at least seven bottles of baijiu spirits during a livestream last Tuesday.", "He was found dead 12 hours after his broadcast, Chinese media reported.", "His death - widely discussed on China's internet - has sparked calls for stronger regulations of the country's booming livestreaming industry.", "The 34-year old, whose last name was revealed as Wang by local media, had specialised in drinking the Chinese liquor during livestreams. Baijiu is a strong spirit that contains up to 60% alcohol.", "On 16 May, he had participated in four one-on-one battles, where influencers compete with each other to to earn the most amount of gifts from fans in a short window of time.", "He lost three of the rounds, after which he drank bottles of baiju as punishment. Viewers said he drank at least seven bottles that night.", "Wang ended his livestreaming after midnight. He was found dead the following afternoon, his friend told a Chinese news outlet.", "\"When his family found him, he was already gone, he didn't even get a chance for emergency treatment,\" a man named Mr Zhao told Shangyou News. A funeral was held on Saturday.", "Douyin already bans drinking during livestreams, with penalties ranging from warnings to users being restricted from livestream competitions and being shown on the app.", "Mr Wang had also been banned from the app before for drinking. But he circumvented this by opening new accounts, Chinese media reported. His most recent account had more than 44,000 followers.", "A report by authorities last year found more than one billion internet users were active on short video platforms like Douyin, and the industry is worth about 199 billion yuan ($28 billion; £22 billion).", "Mr Wang's death has sparked huge scrutiny of the safety and regulations of such apps. The opinion section of the People's Daily newspaper posted a message on Weibo criticising \"livestream behaviours that go off the tracks.\"", "He is just the latest Chinese livestreamer whose death has been linked to their online work.", "In 2021, Yu Hailong, who became popular for eating excessive amounts of food on Douyin, died after \"long hours of high-intensity work\", his agent said.", "In 2018, livestreamer \"Dafei\", who was known for drinking alcohol and cooking oil on camera, also died shortly after an online broadcast."]}