{"title": "Online paedophile reports more than double in Kent in five years", "body": ["The number of investigations into online paedophile activity in Kent has more than doubled within five years, a police force said.", "Kent Police said referrals from the National Crime Agency have risen from 190 in 2018 to 501 last year.", "A year-on-year rise has been noted since the Covid lockdowns, the force told BBC Radio Kent.", "It is now expanding its paedophile online investigation team to deal with the increase in investigations. ", "Det Ch Insp Shaun Creed said: \"We have seen a significant growth in reports and they haven't gone back to pre-pandemic levels.", "\"There was a significant jump between 2019 and 2020, and at the moment it continues to rise year on year.\"", "Elsewhere in the South East, Surrey Police recently reported a 70% rise in investigations in two years.", "The Internet Watch Foundation (IWF), which hunts down and removes online child sexual abuse, has described the issue as \"a social and digital emergency\". ", "It said children were often being coerced, tricked or pressured by abusers on the web. ", "Imagery of young children carrying out sexual acts on camera rose more than tenfold since the pandemic lockdowns, IWF data released earlier this year suggested.", "It logged more than 63,000 webpages showing the material compared to 5,000 before the pandemic.", "Det Con Chris Horan, from Kent Police, warned parents to be aware of offenders befriending or grooming children online.", "\"It will start off with very innocent photos being taken and they will nurture that relationship with that child to progressively more indecent images being taken\", he said.", "Jim Gamble, who led the UK Child Exploitation and Online Protection (CEOP) organisation, told BBC Radio Kent: \"Parents must take the lead in protecting their children. ", "\"They need to educate and empower themselves so they are better equipped to protect their children.\"", "If you are affected by any of the issues in this article you can find details of organisations that can help via the BBC Action Line.", "Follow BBC South East on Facebook, on Twitter, and on Instagram. Send your story ideas to southeasttoday@bbc.co.uk."]}