{"title": "AI: Can you tell that these 'photographs' are artificial?", "body": ["Whether it be artwork, literature, music or photography, content created by artificial intelligence (AI) is on the rise. ", "So advanced is the content being generated that it is becoming increasingly difficult to determine what is real and what is artificial.", "All of these images have been created using AI software on the website Night Cafe. ", "None of the people depicted are real and each picture has been generated by a text prompt.", "A text prompt can be something as simple as \"woman shouting\" or \"twins\".", "The potential pitfalls of such content were recently demonstrated when German artist Boris Eldagsen entered this year's Sony World Photography Award with an AI-generated image and won.", "Mr Eldagsen refused the award and stated he was just being a \"cheeky monkey\" to see if any of the judges \"knew or suspected that [the image] was AI-generated\".", "\"AI images and photography should not compete with each other in an award like this,\" he added.", "Night Cafe founder Angus Russell said: \"Five years ago, People were saying AI would take over the borings jobs, but things that require creativity will be safe for a long time.", "\"But it's turned out the exact opposite. Creative jobs and knowledge-based work could be the earliest things to be replaced.\"", "BBC News picture editor Phil Coomes said that while fake or manipulated images were \"nothing new\", the growth of AI would \"produce some challenges\".", "\"There are tools out there that can help us spot images that have been manipulated,\" he said. ", "\"And these can help with AI too.", "\"But these are not fool proof, of course, and much still relies on close visual examination of the picture.\"", "Dr David Gyimah is an associate professor of innovation at Cardiff University's School of Journalism and is impressed by the hyper-realism of these images.", "\"Everything that you would expect of a good photograph is there,\" he said. ", "\"There's nothing in these in these images that could lead you to believe that they were generated in any other way [such as AI].\"", "Dr Gyimah thinks it is worth considering the potential ill-intentioned uses of AI imagery in journalism and factual content.", "\"We've sort of entered a territory where technology has raced ahead of policy frameworks. And that leaves us in very precarious positions,\" he said. ", "\"It can be used for real maleficent purposes, [and] there may well have to be sanctions. ", "\"Otherwise, how do you enforce people not to use images which they purposefully know are not generated by a camera? So therefore may spur different narratives to the ones that are real as opposed to the ones that perpetrate falsehoods.\"", "As AI-generated imagery becomes more advanced and the code it uses becomes open source, we may be forced to ask the question more often than not: Is it real or is it AI?"]}