{"title": "Council accidentally published staff salaries online", "body": ["The personal details of 15,000 South Lanarkshire Council workers, including their salaries, were accidentally published online. ", "The local authority confirmed staff information was shared in a spreadsheet following a Freedom of Information (FOI) request.", "It is understood the data leak also involved details such as National Insurance numbers. ", "A spokesman for the council said the breach was due to \"human error\".", "But the GMB said it would support any members who wished to take legal action. ", "The information was shared on WhatDoTheyKnow, a website used for submitting and responding to FOI requests.", "The leak, which happened last month, followed an application which asked for details of staff pay grades. ", "In response, a spreadsheet was uploaded which was only supposed to include \"anonymised employee data\". ", "But details on a second page of the FOI response were not anonymised.", "The data shared, which was discovered last week, is understood to have included names, workplaces, salaries and National Insurance numbers. ", "But information such as bank details, dates of birth and addresses were not disclosed.", "A South Lanarkshire Council spokesman told BBC Scotland: \"Unfortunately as a result of human error, the spreadsheet contained a second page of personal data that had not been anonymised.", "\"The error was noticed by the council and we arranged for that data to be removed.", "\"To the best of our knowledge the information was not accessed, and we believe the data could not be used in a way that would be harmful to those involved.\"", "The council said all employees affected by the data breach would be contacted. ", "A report has also been submitted to the information commissioner.", "GMB organiser Ude Adigwe said staff were right to be alarmed.", "He said: \"This is a very concerning incident and poses serious questions about the council's data management processes.", "\"Staff deserve more than a simply assurance from the council that policies and procedures have been tightened.", "\"They deserve an investigation, the fullest possible explanation of how this happened and to be told exactly what measures are being taken to stop it happening again.\"", "Meanwhile, Unison's South Lanarkshire branch said it had met with the council to discuss the issue."]}