{"title": "Five Nights at Freddy's movie: Red eyes in trailer divide fans", "body": ["The first trailer for the long-awaited Five Nights at Freddy's adaptation dropped this week - but some fans aren't happy.", "FNAF, as it's known, is a popular horror game series famous for its cast of creepy, robot animals.", "But the preview revealed that the characters in the film have glowing red eyes which weren't in the games.", "And, while most fans were excited to get first glimpse of the movie, some were upset about the change.", "FNAF, launched in 2014, casts gamers as an employee of a fictional family restaurant chain called Freddy Fazbear's Pizza.", "But you're not alone. Players have to find ways to fight off killer animatronic animals that come to life at night.", "These robot enemies, with their lifeless silver pupils and expressionless faces, led some people to call the series one of the scariest ever.", "But a split-second glimpse at the end of the film trailer shows them sporting red eyes and menacing scowls.", "And fans were further upset when the movie's poster was revealed - showing a line-up of the creatures with glowing red eyes.", "Over on the Five Nights at Freddy's subreddit, where members of the series' large fanbase gather, people had thoughts.", "On one of the most popular threads, some said the red eyes looked \"goofy\" and were \"the one thing holding the trailer back\" from perfection.", "Another fan, speaking about the facial expressions, said: \"The whole creep factor comes from them looking soulless while still moving around.\"", "One user who Photoshopped the poster to remove the red eyes was praised for making it \"much better\".", "Others were a bit kinder, pointing out that the change would help non-fans understand the characters' role more easily.", "Some defended it as a \"creative choice\", while some were confident the red eyes would grow on them over time.", "The movie, written by series creator Scott Cawthorn and starring Hunger Games actor Josh Hutcherson, is due to be released by horror movie studio Blumhouse on 27 October.", "It's not unheard of for films to change before release after fan reaction to a trailer.", "When Paramount released the first preview of the Sonic the Hedgehog movie in 2019, it redesigned the character after a backlash.", "Follow Newsbeat on Twitter and YouTube.", "Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here."]}