{"title": "BeReal v BeReal: Trademark battle set to go to tribunal", "body": ["A small business owner who is in a naming rights row with a French social media app that has the same name has hit out at its \"threatening\" conduct.", "Batool Zaidi filed to register the name of her womenswear company, BeReal, in the UK in November 2020 - a year before the French namesake filed in the UK.", "Lawyers from the social media app ordered her to stop using the BeReal name or face \"urgent court action\".", "The two BeReals are set to battle it out at a tribunal later in the month.", "The French company said it had \"endeavoured to find an amicable resolution for all parties\". ", "Based in Old Street, east London, Ms Zaidi's business doesn't use models; her ethos is for women to embrace their true form. Her company, which employs just two people, runs pop-ups and also works with big global retailers. ", "In Paris, the social media app BeReal is a much bigger business, with a claimed 20 million users, ", "Gaining popularity with teenagers and young adults through the pandemic, the app has made efforts to establish itself globally. Users of the app, which was registered in France in June 2021, aren't allowed to use filters. The idea is that they \"show their friends who they really are\".", "As well as filing for a trademark in the category of software and internet domains, the Paris-based BeReal also filed for the clothing category. When the company applied to register the trademark in the UK, Ms Zaidi filed opposition, in June 2022.", "A few months later, she received a \"cease and desist\" letter from a French lawyer.", "It stated that her brand was infringing a trademark by shipping to Europe - a claim she rejects, as she says she only sends clothes to UK and US customers. ", "It alleged that her brand had \"originated\" from the social media app, which amounted to \"unfair misappropriation\" of the brand across social media.", "Ms Zaidi's company was ordered to stop manufacturing, promotion and marketing using the name BeReal or face \"urgent court action\".", "She said: \"I started this small online shop in lockdown to empower women's fashion and they have just done everything they can to to belittle me and scare me. ", "\"I will not back down because I believe that it's important to stand up to callous companies determined on world domination, happy to trample on everything in their way.\" ", "Ms Zaidi added: \"I was shocked to receive the letter. We don't ship to the EU; the only instance of EU shipping was one order from Paris that had requested it to be sent there, which I did not fulfil.", "\"My womenswear has no impact on their brand whatsoever and we are not in competition. I don't know why they tried to register in the clothing category in the UK as well.\"", "The social media app told the BBC that it had rights to the trademark in the UK based on common law.", "The UK recognises common law rights regarding brands that have not been registered as trademarks, but which have become de facto trademarks as a result of their widespread use and recognition, a BBC intellectual property lawyer explained.", "This means that if the social media brand BeReal could demonstrate that as a result of its extensive use in the UK, it had become recognised as a brand by the public - in relation to clothing in particular and before Ms Zaidi filed her application in November 2020 - it could be in a position to cancel her registration and prevent her use of the BeReal name.", "A spokesperson for the social media app said: \"With both parties being independently owned businesses, we have a deep appreciation of the work that goes into growing them. This is why we first endeavoured to find an amicable resolution for all parties.", "\"After multiple attempts at contacting BeReal Wear Limited, all attempts were left unanswered and thus we were unable to have any discussions for resolution. ", "\"Our priority is protecting our users. We respect BeReal Wear Limited and do not wish to prevent anyone from conducting ethical business. ", "\"With actual consumer confusion arising from the logos being sold, we have to also protect the brand we have built. Ultimately, we wish for both of our businesses to move forward with fair practices that distinguish our company identities. ", "\"We are happy to leave the door open should BeReal Wear Limited decide to respond to our attempts at resolution.\"", "Ms Batool's company is only opposing the social media app in the clothing category. The app has applied for a trademark in various categories and will be allowed to proceed to registration in the unopposed ones once proceedings have concluded, the Intellectual Property Office said.", "Follow BBC London on Facebook, Twitter and Instagram. Send your story ideas to hellobbclondon@bbc.co.uk"]}