{"title": "Tears of the Kingdom: 'Zelda's escapism helps us through tough times'", "body": ["Zelda: Tears of the Kingdom is a certified hit, breaking series sales records and, probably, filling your social feeds with gameplay videos.", "Its open world, focus on exploration and overall depth has earned it overwhelmingly positive reviews from critics and players.", "And its new crafting mechanic has spawned dozens of viral videos showing off gamers' bizarre creations.", "But for some fans it's more than just a game.", "They've been telling BBC Newsbeat how Zelda and the communities that formed around it have helped them through difficult times.", "The series is famous for its sense of escapism - players can spend hours outside the main quest, roaming the world at their own pace.", "Nintendo fan and Twitch streamer Derby Munns says this element was what drew her in.", "Last summer, she turned to prequel Breath of the Wild (BotW) as she experienced a \"pretty horrible bereavement\".", "\"It made the whole summer feel awful,\" says Derby.", "But she says BotW \"was able to take me out of the moment that I was in, in real life, and take my mind off things\".", "The game also delved into subjects like memory and bereavement, something Derby says helped her personally.", "\"There's some pretty deep themes that run throughout,\" she says. ", "\"I think the game guides you through characters going through similar things that you might be experiencing and shows you how they're dealing with their emotions in different ways and how they're coming out on the other side.\"", "Fellow fan Amber Elphick was starting to move away from home when BotW was first released in 2017.", "\"I was leaving family and friends behind,\" she says.", "\"Playing the Legend of Zelda helped ground me, because I had a really big community of gamers who were all playing it as well.\"", "Amber says the game's open-ended nature, which means it can be played in any way people choose, was therapeutic for her.", "\"The whole world is open to you,\" she says.", "\"If you want to go and collect all the different fruits and take loads of pictures, you're free to do that. And that can make it a very relaxing experience\". ", "The success of Tears of the Kingdom (TotK) has earned attention from media outlets where you might normally expect to see negative stories about games.", "And Amber says more coverage should focus on how titles like Zelda can make people happier and healthier. ", "\"I think when people see the negative side, they don't understand how much positivity games can bring\", she says.", "One person focusing on the positive impact games can have is Sky, who works for Safe In Our World.", "It's a charity that looks at mental health in the gaming industry, and is putting on a summit about it with BAFTA this month.", "Sky's also turned to Zelda, \"running around Hyrule Field and being immersed in the sounds and sights\", when feeling stressed, upset, or burnt out.", "Games are great at \"transporting you somewhere else\", Sky says, but the networks that spring up around them can be equally helpful.", "Online fandoms can get a bad press but Amber, who lives in Norwich, now runs a Nintendo fan community and says it's helped her and others find meaningful connections.", "That's an experience Derby can relate to. ", "\"If you're not necessarily finding people in real life that you want to hang out with, games can be a great way to find and meet people,\" she says.", "And Sky says this can be especially helpful for neurodivergent people. ", "\"I find it quite difficult to make friends, make conversation and meet new people,\" says Sky. ", "\"For me, it's been a way to begin to start opening up and forming friendships when I might not otherwise be willing to engage in conversation.\"", "One of Safe in Our World's aims is to encourage people to reach out for help when they need it.", "Games can be a great way to take your mind off things, but they might not be the answer to all problems.", "\"It's nice to use as a tool to hold your hand through tough times,\" as Derby says.", "But Derby, who plans to spend many hours in TotK's Hyrule, says she's comforted to know it's there for her when she feels like she needs it.", "\"If you're finding every day a struggle in real life, you can just get out Zelda, and because the world is so bright, you can just escape.\"", "For information about organisations and resources around mental health and other issues, visit BBC Action Line.", "Follow Newsbeat on Twitter and YouTube.", "Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here."]}