{"title": "How the power of protein is being uncovered", "body": ["The Light Gas Gun at the University of Kent is an unwieldy device which, to me, looks more like a lathe than a gun.", "Despite its lumbering appearance the gun can fire projectiles at a speed of 1.5km per second, or around 3,500mph, that's almost twice the speed of a bullet.", "Today it has been loaded up with a piece of of basalt rock, a bit smaller than a pea, which will be blasted at a very special gel. ", "The gel is made of the protein talin - or at least a version of the protein that has been refined and tweaked to give it an extraordinary ability to absorb impacts, as we are about to find out.", "We are herded out of the gun room and after a quick countdown the gun operator, Luke Alesbrook, pushes the button, triggering the gun.", "Back inside smoke wafts from the gun barrel as the target is removed. On inspection, the gel has been pushed around a bit but, amazingly, is still intact.", "What's important is that the metal plate behind the gel is not damaged. Without the gel the basalt would have torn a chunk out of the plate.", "Talin can absorb force thanks to unique mechanical properties. Its structure includes spirals of amino acids - the building blocks of proteins - which form bundles. When pulled the bundles unfurl, increasing the length of the protein by a factor of 10.", "When the stress is released the bundles snap back into their original position, kind of like a spring.", "Prof Ben Goult worked out the structure of talin and how it responds to forces and, with his colleague Prof Jennifer Hiscock, they came up with the idea of making talin into a shock-absorbing material.", "\"I literally wandered into Ben's office and he was talking about his wonderful protein. And I said we have to make a bulletproof vest - this is what we have to do,\" she says.", "Starting in 2016 their team developed a way to join the talin proteins together into a lattice - like a net with an almost cartoon-like ability to stretch and rebound.", "It's been a long haul for Prof Goult who has been involved with working out the mechanical properties of talin and its structure since 2005.", "\"It wasn't easy. It took a team of six of us over four years to work out the protein structure of talin, and another four years to work out how talin responded to force\" he says.", "Proteins are complicated molecules to decipher. They are made up of a chain of amino acids, a bit like beads on a string. There are 20 different naturally occurring amino acids - or beads - so there are a bewildering number of ways they can combine. ", "Traditionally working out those structures was done using electron microscopy and X-ray crystallography, a process which could take years.", "But in recent years artificial intelligence (AI) has revolutionised the process, predicting the structures of hundreds of millions of proteins.", "A key event came in November 2020, when AlphaFold performed best at CASP 14, an assessment every two years where different computer programs predict the structure of proteins. ", "Not only did AlphaFold outperform rival systems, it predicted the structure of the proteins with a level of accuracy way beyond its rivals.", "\"That was pretty crazy,\" says Kathryn Tunyasuvunakool, who helped develop AlphaFold, along with others at London-based DeepMind, the AI division of Alphabet, the parent company of Google.", "\"We knew that we had pretty good results internally going into that CASP. But it wasn't at all clear whether other people would have similar results. It was, I guess, a bit of a surprise to us to see just how large the margin was compared to other groups,\" says Ms Tunyasuvunakool.", "That version of AlphaFold - AlphaFold2 - was so good, that in the next competition all the best performing teams used versions of it. ", "Thanks to AlphaFold and its offspring the database of protein structures has gone from a few hundred thousand to hundreds of millions.", "For scientists and researchers, particularly in drug development, this is a bonanza. Proteins with structures that look promising for certain uses, like binding to a cancer cell, can be identified more quickly than ever before - the pace of research has been accelerated.", "But even AlphaFold has its limitations. Proteins often work by interacting with other molecules and at the moment AlphaFold can only predict the protein part.", "And as Prof Goult discovered with talin, proteins are dynamic molecules that change form. AlphaFold can gives researchers a static picture, but can't model those changes.", "Also, scientists might also want to design proteins from scratch, to do specific tasks. That's the focus of Prof David Baker, head of the Institute for Protein Design at the University of Washington, just outside Seattle.", "His team has developed an artificial intelligence based on DALL-E, an AI which generates original images.", "Called RF Diffusion, it was trained by breaking down known proteins and then reassembling them in steps. ", "Scientists using RF Diffusion decide on a particular characteristic they want from a new protein - perhaps a catalyst for a certain kind of chemical reaction, or a protein that can bind to a particular target.", "They can feed their requirements into RF Diffusion and it will come up with a suitable protein structure.", "\"I think RF diffusion is a step change compared to what we had before,\" says Prof Baker.", "\"The potential of designing proteins that solve so many different problems is really great,\" he adds.", "He sees new treatments emerging for cancer, neuro-degeneration and infectious diseases. Industry might benefit from catalysts which can speed up reactions or make them more efficient.", "Plus, according to Prof Baker, whole new materials could emerge. For him, the possibilities make protein research a compelling place to work. ", "\"It's an extremely exciting area right now. For young scientists just starting out on a career, it's probably one of the most exciting areas in science today,\" he says.", "More technology of business:", "Back in Kent, Professors Goult and Hiscock are working on scaling up production of their protein talin, with investment coming from the Ministry of Defence.", "The idea is to make enough of their shock-absorbing gel for a much bigger test. The Kent scientists think that one day their gel might be able to reduce the amount of heavy ceramic used in today's bulletproof plates. ", "For now, Prof Hiscock still marvels at how their protein gel comes together.", "\"It's a beautiful process, the spontaneity of it, and the fact that all those molecules can come together to form those fibrous networks.\" "]}