{"title": "Can you get cheaper broadband deals with social tariffs?", "body": [" Up to one million people have cancelled their broadband in the past year because of the high cost of living, a survey by Citizens Advice suggests.", "But, at the same time, according to the regulator, Ofcom, 4.3 million eligible people are missing out on cheaper broadband deals.", "Here are some things to consider if you're wondering whether you could pay less to get online.", "First, tell your supplier.", "According to the government, people struggling to pay their bills can access support to stay connected - such as through payment plans or by being allowed to switch to a cheaper internet package without paying a penalty fee. ", "This might mean dropping down to a package with a slower internet speed, though this could present challenges for people in larger households.", "People near the end of your contract may benefit by switching to a different supplier altogether - or may be able to negotiate down the price of their current package.", "But other support is available for people struggling with their bills.", "Ofcom has helped bring so-called social broadband and mobile tariffs, which aim to support people on universal credit and other means-tested benefits, to the market.", "You are eligible for a social tariff if you receive any of the following benefits:", "Ofcom's website also states a social tariff can be accessed as long as one person in your household claims universal credit.", "The social tariffs can be found on Ofcom's website.", "Prices range between £10 and £20 per month, depending on the package and offering a variety of different internet speeds.", "For example, Virgin Media offers:", "There also other benefits to a social tariff beyond the relatively low monthly fee. There are no charges for getting a package, no fee to leave before the contract expires, and the price won't increase midway through.", "However, which package you can access will depend on where you live, as not all properties can receive every broadband service. Those in rural areas in particular will have limited options.", "Before choosing a supplier you should consider exactly what internet speed suits your particular needs.", "That comes down to:", "BBC iPlayer and Netflix both recommend a 5Mbps connection to stream a programme in high quality, so you might think a 10Mbps connection is enough.", "But the moment two people in a household are both streaming video, that would put the connection at capacity - and that's assuming you aren't using your phone while streaming video.", "You should also keep in mind the speeds quoted are average speeds. A 100Mbps connection may sound like a lot - but you may not get that speed all of the time.", "If you're not eligible for a social tariff, your best bet would be to use a comparison website to see what deals are available in your area.", "At the time of writing, for example, there are 67Mbps broadband packages available for about £25 per month from some suppliers.", "But you should be aware the advertised costs change as companies increase their prices every spring - with the highest price hike coming in at 17.3% this April.", "This means a person paying £25 per month in March 2023 may have seen their bill increase to more than £29, with another potential price hike coming in 2024."]}