{"title": "Mortgage rates: Average two-year fix rises by £35 a month", "body": ["An average two-year fixed-rate mortgage deal is £35 a month more expensive than a few weeks ago, new figures show.", "The interest charge has gone up by 0.3% since recent data showing inflation not coming down as quickly as expected, financial data firm Moneyfacts said.", "The surprise led many to predict the Bank of England will raise rates higher than previously thought, from their current 4.5% to as high as 5.5%.", "It has prompted many lenders to raise mortgage rates and also remove deals.", "Hundreds of mortgage deals have now been pulled from the market as lenders reassess their offers.", "Over the weekend, several lenders made changes to their mortgage deals which are expected to further squeeze the budgets of households and firms.", "On Friday, TSB withdrew all of its 10-year fixed-rate deals with less than three hours' notice, in a move first reported by The Times. The bank insisted the move was \"temporary\" and that the deals would return.", "Santander's new business mortgage rates increased between 0.05% and 0.43% on Monday, and Coventry Building Society is hiking its two-, three- and five-year deals on Tuesday.", "Are you struggling to get a mortgage or one that's affordable? Are you looking to re-mortgage following a fixed deal? You can share your experiences by emailing haveyoursay@bbc.co.uk.", "Please include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:", "According to data from Moneyfacts, given to 5 Live's Wake up to Money, the average two-year fixed rate on a £200,000 mortgage over a 25-year term is now 5.64%.", "That compares with 5.34% before the latest inflation data.", "It comes as new data from UK Finance shows people increasingly taking out mortgages over longer terms, with a record one in five first-time buyers opting for mortgages of more than 35 years.", "UK Finance suggested customers might be choosing this option \"in order to lower monthly payments and, thereby, improve their affordability calculations\".", "The Bank of England has been steadily raising interest rates for the last year and a half, as it tries to tackle soaring prices.", "People on a variable rate, or tracker, will have been affected immediately by the rate increases. But many of those on fixed-rate deals will not have felt the pain yet.", "According to UK Finance, 1.5 million people are scheduled to end their fixed-rate deals this year. Of those, 800,000 are scheduled to come off their deals in the second half of this year.", "Sarah Coles, head of personal finance at Hargreaves Lansdown, said those people were now facing a \"remortgage nightmare\".", "\"They've been shielded from the horror of rate hikes so far by a fixed mortgage, and when their deal runs out, they face the full force of the rises in one single hit,\" she added.", "As far as Kevin, 67, is concerned the Bank of England strategy of raising interest rates to curb inflation is a case of the cure being worse than the illness.", "The facilities director from Tonbridge, Kent, has seen his monthly payments more than double since he came off a fixed-rate deal just over a year ago.", "After interest rates rose again last month he got a letter through the post saying he would be paying an extra £75, taking monthly payments to £1,130.", "\"It's painful,\" he says. \"There seems to be no end in sight and it's getting ever more difficult because it's not just the mortgage that's gone up. Food prices have too.\"", "Inflation shows the rate at which prices are rising. The rate has shot up over the past 18 months, as food and energy prices have soared, leaving many household feeling squeezed.", "Last month's data showed the rate of inflation fell to 8.7% in the year to April - down from 10.1% in March but above the 8.2% figure expected.", "Read more here", "Last week, the Nationwide warned that more rises in mortgage interest rates could hit the housing market.", "The building society's comments came as its latest data indicated UK house prices fell at their fastest annual pace for nearly 14 years in May. It added that \"headwinds to the housing market look set to strengthen in the near term\".", "A drop in house prices would generally be welcomed by first-time buyers, who have watched property values continue to climb in recent years, even during the pandemic.", "However, rising interest rates means that mortgage costs are now higher than many people looking to get on the housing ladder might have planned for."]}