{"title": "TikTok ban: What could it mean for creators?", "body": ["Is TikTok going to be banned? It's a question lots of people are asking.", "And the answer, for now, seems to be no. It's unlikely that the massively popular app's going to disappear anytime soon. ", "But the US government has been talking about outlawing it, and politicians in America have been grilling its boss over privacy and national security concerns.", "One state, Montana, has just passed a law that will ban TikTok on personal devices from next year.", "It's a nervous time for content creators who've made a career on the app with content like comedy sketches, music, or beauty tutorials for their followers.", "BBC Newsbeat spoke to three popular TikTokers who have no plans to give up on it yet.", "Arthur Hill started posting comedy clips on TikTok while he was still at uni. Today he's got a following of 1.4 million and is probably most well-known for videos of him sharing a bed with singer James Blunt.", "Arthur's been aware of concerns around TikTok since he started using it but confesses he's a \"bit of an idiot\" when it comes to online privacy.", "\"I'm so obsessed with everything being easy that I will just say, yeah, I'll sign up to that and give my details. So I'm the worst,\" he says.", "\"At the start, I thought it might have been a more of a conspiracy theory thing,\" he says.", "But recent government device bans and the congress hearing have made him less sure.", "Arthur thinks getting rid of TikTok now \"would be pretty major and screw up a lot of people's livelihoods and careers\". ", "\"I think that'd be a massive ripple effect as well in terms of other apps. And how Instagram would react and how YouTube would react. ", "\"I think it would all go a bit wrong.\"", "Arthur, who's already started branching out on to YouTube and Instagram, feels he is \"lucky\" as a comedian because his content can work on other sites.", "If TikTok does disappear Arthur is hopeful that something will eventually come along to replace it - but he's not sure how quickly that will happen.", "\"I feel like they've nailed it so perfectly on the head. And I don't know if anyone could recreate the algorithms.\"", "Music is part of TikTok's DNA, and tracks that go viral on the app can become huge mainstream hits.", "Rapper Stepz, from Croydon, was named TikTok's breakout artist last summer. He's now got 3 million followers.", "He says the app allowed his brand of music - positive drill - to blow up, and doesn't think this would have happened in such a big way on other apps.  ", "\"Rap music in the UK was all about stab this, stab that, but now kids that actually have talent can show their sound and if it's good it will go off,\" he says. ", "Stepz says the app has given young people a platform where record labels and scouts can see their work, and allowed him to break into an industry he might not have been able to afford otherwise.", "In his view, banning TikTok would \"damage the music hard\".", "\"Imagine posting a video and you get 100,000 views or a million, that gives you opportunity,\" he says.", "Stepz doesn't think his success is only down to TikTok - he says self-belief and his faith made him feel \"it would have happened\" anyway.", "\"But I don't think it would have been as fast,\" he says.", "Monique started her beauty and skincare channel - the Skinfiltrator - during the pandemic, and her account has grown to 160,000 followers.", "She has millions of views on a number of her videos, and she says this is because the app \"rewards smaller creators\" more than other platforms.", "Monique says she's found a worldwide audience and also struck up partnerships with some of the biggest beauty brands in the world.", "She says this \"definitely\" wouldn't have happened without TikTok.", "\"If I meet people, they'll say, 'Oh, you do skincare on TikTok'. So it wouldn't be possible. There's no way.\"", "As a creator specialising in tips for Black and Asian skin, Monique says TikTok's algorithm \"doesn't discriminate\".", "She admits TikTok is \"not perfect\" with regards to race, but she says being selected for a black creator programme on the app made it the \"only social platforms where I've really felt that support\".", "\"I've been able to connect even with dermatologists, skincare experts in my industry from overseas, and that allows me to get the best knowledge,\" she says.", "Monique also thinks consumers would lose out if TikTok were banned, as it's made it easier for companies that make specialist products to reach new audiences.", "She puts TikTok's popularity down to its authenticity, something apps like Instagram have been criticised for lacking.", "\"People are tired of hard sales. They're tired of creators being fake and influencers being fake. They want authenticity and they want things that are relatable, and Tik Tok is very relatable. ", "\"So I just don't think it's gonna be replaced by another app any time soon.\"", "Follow Newsbeat on Twitter and YouTube.", "Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here."]}