{"title": "Elon Musk: I will say what I want even if it costs me", "body": ["Twitter owner Elon Musk has defended his controversial social-media presence, saying he will \"say what I want\" even if it loses him money.", "Mr Musk was responding to accusations of antisemitism on Twitter, after his tweet George Soros \"hates humanity\" was criticised by the Israeli government.", "The tweet was seen as playing into frequently debunked conspiracy theories about the Jewish philanthropist.", "But Mr Musk told CNBC he held no antisemitic views.", "He also used the interview to call working from home \"morally wrong\" and criticise technology rival OpenAI.", "Soros Fund Management cut back the shares it owned in Mr Musk's Tesla company, in May.", "But company founder Mr Soros is a regular target of conspiracy theories by right-wing figures in the US.", "And the Israel Foreign Ministry retweeted a post from the country's digital diplomacy director, David Saranga, sharing Twitter trending figures showing more than 27,000 tweets using the term \"The Jews\" following Mr Musk's post.", "Former Labour MP David Miliband, Foreign Secretary under Gordon Brown, called Mr Musk's remarks \"totally disgusting\" and said he should retract them.", "But this was not the only part of the interview to draw criticism.", "Mr Musk was also questioned about a tweet in which he asked whether a mass shooting had been part of \"a very bad psy-op\" - a baseless conspiracy theory.", "A \"psy-op\" - or \"psychological operation\" - is a military term for actions used to target and influence behaviours.", "Mr Musk's words carry considerable weight.", "One of the world's richest and most influential people, he also owns one of its largest social-media platforms - where he has the single biggest account, with nearly 140 million followers.", "But in recent months, Mr Musk has increasingly been engaging with false or misleading claims on Twitter. ", "His remark about the Texas shooting - and Bellingcat, an investigative organisation that reported on it - are the latest in a series of such Twitter engagements by Mr Musk. ", "Previously, he had repeated misleading claims about:", "While Mr Musk often tries to be careful with the wording of his tweets, he has been more explicit in promoting the false claim the Texas shooter did not have a neo-Nazi ideology and his online profile might have been a \"psy-op\".", "This is despite major news outlets reviewing and verifying the shooter's online profiles and Texas police confirming he had extremist and neo-Nazi beliefs.", "Some of Mr Musk's recent tweets have been fact-checked by Community Notes, a Twitter feature that allows users to add context to false or misleading claims via a voting system.", "Elsewhere in the interview, Mr Musk also took aim at working from home.", "\"It's not just a productivity thing,\" he said. \"It's morally wrong.\" And it was unfair some people, such as baristas or shop assistants, had to attend work in person while others did not.", "Mr Musk also suggested the way OpenAI had developed technology such as ChatGPT was unsafe.", "He said earlier on Tuesday that he was the reason OpenAI existed and in the interview added that he had come \"up with the name\".    ", "In March, Mr Musk was one of many public figures to sign a letter asking for artificial-intelligence development to be put on hold so safeguards and regulation could catch up.", "But the following month, he created rival AI company X.AI.", "OpenAI chief executive Sam Altman has not responded to Mr Musk directly but appeared before a Senate Committee on Tuesday calling for AI growth to be regulated. "]}