{"title": "Ex-Apple engineer accused of stealing self-driving car secrets", "body": ["A former Apple engineer has been charged with stealing the company's self-driving car technology, almost five years after he fled to China.", "Prosecutors accuse Weibao Wang, 35, of stealing thousands of files containing proprietary information while secretly working for an unnamed Chinese company.", "Six counts of theft or attempted theft of trade secrets are in the indictment.", "This is the third time an ex-Apple employee has been accused of stealing autonomous tech secrets for China.", "The justice department alleges Mr Wang stole documents containing the source code for the software and hardware behind the self-driving systems.", "Mr Wang joined Apple in March 2016 as a member of the team that developed technology for autonomous systems, the justice department said.", "He signed a confidentiality agreement about the project, which was at the time known to very few people within the company. ", "Mr Wang left Apple on 16 April 2018, the indictment said. Unbeknownst to the firm, he had accepted an offer more than four months earlier to work as an engineer at another company developing self-driving cars, said US prosecutors. ", "That company, unnamed in the indictment, is based in China, said prosecutors.", "Law enforcement searched Mr Wang's home in Mountain View, California, in June 2018 while he was there. ", "He told authorities he had no plans to leave the US. That same day, he bought a one-way ticket from San Francisco to Guangzhou, China, the justice department said.", "An analysis of the devices seized from Mr Wang's home showed he had stored large quantities of Apple data on self-driving car technology.  ", "In a press conference, the US Attorney for the Northern District of California, Ismail Ramsey, said Mr Wang remained in China.", "If he were ever extradited and convicted, he could face 10 years in prison for each of the six charges.", "Apple did not respond to BBC's request for a comment. ", "Two other former Apple employees have previously been charged in similar cases involving the theft of trade secrets.", "Xiaolang Zhang pleaded guilty last year in a court in San Jose, California. He was arrested in 2018 as he tried to board a flight to China.", "Another ex-Apple employee, Jizhong Chen, faces similar charges."]}