{"title": "US-Taiwan relations: New trade deal signed as China tensions rise", "body": ["The US and Taiwan signed a new trade deal on Thursday as tensions with China rise.", "It is the first agreement under a framework for talks between Washington and Taipei called the US-Taiwan Initiative on 21st Century Trade.", "The announcement comes ahead of a high-level global security summit in Singapore this weekend.", "In recent years, the relationship between the US and China has become increasingly strained.", "Taiwan's Office of Trade Negotiations said the agreement was signed on Thursday morning, US time.", "Deputy United States Trade Representative Sarah Bianchi attended the event, held near Washington at the offices of the American Institute in Taiwan, the US government said.", "The deal, which includes measures to streamline border procedures, is the first agreement to be signed under the new framework, which started last year.", "The framework aims to strengthen economic ties between Washington and Taipei, and open Taiwan to more US exports.", "\"We thank our Taiwan partners for helping us reach this important milestone and look forward to upcoming negotiations on additional trade areas,\" said Sam Michel, spokesperson for the office of the US Trade Representative.  ", "Beijing has denounced the trade talks, as it does with all forms of high-level engagement between the US and Taiwan, which it claims as its own territory.", "China warned Washington earlier on Thursday against signing any deal \"with connotations of sovereignty or of an official nature with China's Taiwan region\".", "Foreign ministry spokeswoman Mao Ning told reporters that the US \"must not send the wrong signals to Taiwan independence forces in the name of trade\".", "The deal was signed ahead of the Shangri-La Dialogue annual defence summit, which begins on Friday.", "US Defense Secretary Lloyd Austin and his Chinese counterpart Li Shangfu are expected to travel to Singapore for the event.", "Earlier this week, the Pentagon said Beijing had declined Washington's invitation for the two officials to meet.", "General Austin told reporters after meeting Japanese Defence Minister Yasukazu Hamada in Tokyo on Thursday that China's decision was \"unfortunate\".", "Gen Austin added that it was important for countries with \"significant capabilities\" to talk to each other so they can \"manage crises and prevent things from spiralling out of control unnecessarily\".", "Relations between Taiwan and China deteriorated sharply following a visit to the island by the then-US House Speaker, Nancy Pelosi in August.", "Beijing condemned Ms Pelosi's visit as \"extremely dangerous\".", "China sees the self-ruled island as a part of its territory and insists it should be unified with the mainland, by force if necessary.", "But Taiwan sees itself as distinct from the Chinese mainland, with its own constitution and democratically-elected leaders."]}