{"title": "House prices fall at fastest pace in nearly 14 years, says Nationwide", "body": ["UK house prices fell at their fastest annual pace for nearly 14 years in May, the Nationwide has said.", "The building society said prices in the year to May dropped by 3.4%, the biggest decline since July 2009.", "It also warned that more rises in mortgage interest rates could hit the housing market.", "Mortgage rates have risen recently on expectations that the Bank of England will have to lift interest rates again because of stubbornly high inflation.", "As a result, the Nationwide said \"headwinds to the housing market look set to strengthen in the near term\".", "House prices edged down by 0.1% in May itself, the Nationwide said, and the average property price now stands at £260,736. ", "Average prices are still 4% below their August 2022 peak, it added.", "A drop in house prices would generally be welcomed by first-time buyers, who have watched property values continue to climb in recent years, even during the pandemic.", "However, rising interest rates means that mortgage costs are now higher than many people looking to get on the housing ladder might have planned for. ", "New figures from the Bank of England showed the amount of mortgage debt borrowed was at its lowest level on record in April, excluding the period since the beginning of the Covid pandemic. Overall, borrowers repaid £1.4bn more on their mortgages than banks lent out.", "The Bank also said net mortgage approvals for house purchases fell to 48,700 from 51,500 in March.", "Official figures last week showed the UK inflation rate - which charts rising prices - slowed in April by less than expected to 8.7%.  ", "That led analysts to predict that the Bank of England will have to raise interest rates above their current level of 4.5% to as high as 5.5% to try to slow price rises.", "In the wake of the inflation data, a range of lenders increased their mortgage interest rates, with Nationwide making the most significant move with a rise of up to 0.45 percentage points.", "According to financial data firm Moneyfacts, the current average interest rate on a two-year fixed-rate mortgage is now 5.49% compared to a year ago when it was 3.25%. ", "A five-year fixed-rate deal is currently 5.17%, above a 3.37% rate this time last year.", "Figures released earlier this week also showed that nearly 10% of UK mortgage deals have been taken off the market since last week.", "Are you affected by issues covered in this story?  Share your experiences by emailing haveyoursay@bbc.co.uk.", "Please include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:", "Nationwide noted that interest rates were also projected to remain higher for longer.", "\"If maintained, this is likely to exert renewed upward pressure on mortgage rates,\" said Robert Gardner, Nationwide's chief economist.", "However, he said that the building society was not expecting a dramatic downturn in the housing market, given that \"labour market conditions remain solid and household balance sheets appear in relatively good shape\".", "Recent figures have indicated that the number of property sales has been falling. According to HM Revenue and Customs data released on Wednesday, the number of transactions in April was 82,120, down 25% from a year earlier.", "Sarah Coles, head of personal finance at Hargreaves Lansdown, said the recent changes in mortgage costs and availability may well have brought confidence in the property market \"crashing down\".", "While she said we would not see a repeat of the turmoil seen in the wake of last year's mini budget, mortgage rates are likely to rise in \"the immediate future\".", "\"We can expect this to filter through into less demand, lower sales, and weaker prices.\"", "She added that the latest mortgage lending figures from the Bank of England made \"miserable reading\".", "\"It reflects just how property sales have dried up at the start of 2023.\"", "Read more here"]}