{"title": "Stack Whitley Bay divides businesses as plans submitted", "body": ["Plans for a new shipping container leisure venue in Whitley Bay have split opinion among businesses in the town.", "Danieli Group wants to build a Stack complex in the former Empress Ballroom at Spanish City.", "Stack bosses said it would bring the building back into use and attract people to the area.", "While some businesses welcomed the scheme, others said it would harm the town centre regeneration by drawing trade away to the seafront.", "Stack, which has a complex in Seaburn, is already building sites in Durham and Bishop Auckland while plans have also been approved for a site in Carlisle.", "The plans for the former Empress Ballroom include a live entertainment stage, street food outlets, bars and a roof terrace.", "Danieli Group chief executive officer Neill Winch said it \"would bring an underutilised building\" back into use.", "He added that it would \"continue to build Stack's strong presence\" in north-east England.", "Several independent food and drink businesses said the development could \"hurt\" trade, according to the Local Democracy Reporting Service.", "Mark Hirb, owner and manager of the Crab and Waltzer, said: \"It won't help me, it is not going to be in my favour. There are enough eateries here now.", "\"I think another one is going to hurt.\"", "Tony Patton, owner of the Dog and Rabbit pub, said he believes it could \"set back the regeneration of the town centre\".", "He added that it could have a \"pied piper effect\" and take \"everyone to the seafront\" and away from the town.", "But others have welcomed the plan, including Nicholson's Butchers owner Kathryn Meadows who said it would be \"fabulous\" and \"bring more people to the town\".", "She said: \"It will attract a younger community which is exactly what we need.\"", "Nichola Strasser, the proprietor of Anne Thomas Workwear, said it would be \"brilliant\", adding: \"We need somewhere for the youngsters to go and the oldies too.\"", "North Tyneside Council is due to decide on the application later this year.", "Follow BBC North East & Cumbria on Twitter, Facebook and Instagram. Send your story ideas to northeastandcumbria@bbc.co.uk."]}