{"title": "Amazon staff protest climate record and office return", "body": ["More than 1,000 staff at Amazon participated in a one-hour protest over the internet giant's climate record and its push to bring office staff back to offices, according to organisers.", "The action was put together by staff advocacy groups.", "They said morale at the company was at an \"all-time low\" due to a series of \"short-sighted decisions\" by leaders. ", "Amazon disputed the number of participants, while saying it respected workers' rights to express opinions.", "It said its security team counted closer to 300 employees taking part in the protest at the company's headquarters in Seattle and it was not aware of any other physical walkouts.", "Prior to the event, organisers had said about 2,000 staff had pledged to take part, including about 900 in Seattle.", "\"Our goal is to change Amazon's cost/benefit analysis on making harmful, unilateral decisions that are having an outsized impact on people of colour, women, LGBTQ people, people with disabilities, and other vulnerable people,\" the groups, Amazon Employees for Climate Justice and Amazon's Remote Advocacy group, said.", "The protest comes as Amazon has been on a cost-cutting drive, responding in part to economic uncertainty that has slowed sales in many parts of the company, including e-commerce and its cloud-computing division.", "It has announced 27,000 layoffs since January and reduced investments in many areas, including pausing construction in a high-profile corporate campus near Washington, DC. ", "The company, which employs more than 65,000 corporate and tech employees near its headquarters and more than 350,000 such workers globally, also ordered office staff to work in the office at least three times per week, starting in May, saying it would improve the firm's communication and culture. ", "Organisers said leaders were exhibiting \"day 2 decision-making and taking us in the wrong direction\" - a reference to a company catchphrase developed by Amazon founder Jeff Bezos, who called for \"day 1\" thinking focused on innovation and long-term goals.", "They said they wanted more flexibility in how they work and for the company to put the climate at the forefront of its decision making. ", "They also accused the company of under-counting its carbon footprint, pointing to a report that said Amazon considered only Amazon-brand products in its calculations. ", "Company spokesman Brad Glasser said the firm was \"always listening and would continue to do so but we're happy with how the first month of having more people back in the office has been\".", "He said Amazon remained committed to meeting its 2019 commitment to be carbon neutral by 2040 and was in course to rely entirely on renewable energy sources by 2025. ", "The firm has been electrifying its fleet of delivery vehicles, among other steps.", "\"We will continue investing substantially, inventing and collaborating both internally and externally to reach our goal,\" he said. "]}