{"title": "CBI boss admits vote on plans to change 'critical'", "body": ["The boss of the CBI business group has admitted the result of a vote on its plans for change following allegations of sexual misconduct is \"critical\".", "Rain Newton-Smith said there was \"no doubt\" that the vote among its members on reforms at the organisation was a \"really important moment for us\".", "She told the BBC the CBI had spoken to more than 1,000 firms in recent weeks.", "The group is fighting for survival after allegations of rape and sexual assault against staff. ", "The misconduct claims have resulted in some big household names among its 190,000-strong membership to leave, including John Lewis and BMW. Others such as Tesco and Sainsbury's have also suspended engagement with the group.", "The government has also paused activity with the CBI. Chancellor Jeremy Hunt has said there was \"no point\" working with the lobby group when its own members had deserted it.", "Remaining members began voting on Wednesday on the CBI's \"programme of change\", which has been designed to restore trust in the body.", "The result of the vote, to be revealed at an extraordinary general meeting on 6 June, is likely to be seen as a key vote on the future of the organisation.", "The group has suspended its day-to-day operations due to the allegations and will only resume work if members back its plans for change.", "CBI director-general Ms Newton-Smith, said the group had \"listened\" and was \"taking accountability\".", "\"I don't think anyone had given up on us yet,\" she told the BBC's PM programme.", "\"I wouldn't be here to lead the organisation if I thought everyone had given up on what we represent. What is clear is that we need to show that we have our members behind us....that they believe in this programme of change that we are setting out.\"", "The CBI boss said with inflation, slow economic growth and the cost of living hitting businesses, the UK needed an \"organisation that can speak across regions and nations\" and one that \"can speak on behalf of sectors, that can speak on behalf of our farming community, that can speak on behalf of the very large businesses\".", "\"We can be that voice where we have the trust of our members,\" she added.", "Earlier on Wednesday, the CBI announced its president Brian McBride would step down earlier than planned as part of an overhaul of the leadership of the embattled group.", "Mr McBride is to start the search for his successor, with the handover due to take place in the new year.", "When the first allegations of harassment and sexual assault emerged in early April, the lobby group asked the law firm Fox Williams to investigate.", "Following the release of the Fox Williams report, Mr McBride began an examination of the CBI's governance.", "As a result of this work, the group will begin an accelerated search for Mr McBride's successor, the CBI said on Wednesday.", "Other moves include a refresh of the CBI board, and the creation of a new committee to focus on people and human resources matters at the CBI.", "The CBI - the Confederation of British Industry - speaks to the government on behalf of around 190,000 businesses. These firms employ millions of people. ", "It is one of the UK's most prominent lobby groups and, according to its former president Paul Drechsler, was instrumental in protecting millions of jobs during the Covid pandemic by helping the rapid roll-out of the furlough scheme.", "The CBI campaigned against Brexit. Once the UK voted to leave the European Union, it lobbied the government to secure a trade and co-operation agreement.  ", "It also aims to promote and share best practice among its members. Founded in 1965, today it employs around 300 people.", "Mr McBride said the group was making \"significant and fundamental changes\" to improve the organisation.", "\"We remain determined to restore the confidence of our members, and that of our many stakeholders, in the CBI,\" he added.", "The allegations at the CBI include claims of harassment and sexual assault including two allegations of rape, one at a summer party held by the group in 2019, another at one of its overseas offices.", "The City of London Police is currently investigating the rape allegations.", "The director general of the CBI, Tony Danker, has already been dismissed. He was the subject of separate complaints of workplace misconduct, unrelated to the sexual assault and rape claims, for which he has apologised."]}