{"title": "Train strikes this week to hit FA Cup final and Epsom Derby", "body": ["Rail services ground to a halt in parts of the country on Wednesday as a fresh wave of strikes began. ", "Members of the train drivers' union Aslef walked out and will do so again on Saturday 3 June, the day of the FA Cup Final, while members of the RMT will strike on Friday.", "Aslef said there was \"no waning in enthusiasm\" in the long-running dispute over pay and conditions. ", "The government said the strikes were co-ordinated to disrupt major events.", "Wednesday's strikes will affect 15 train companies, with services due to start later and finish much earlier than usual - typically between 07:30BST and 18:30.", "About 40% of trains will run, but there will be wide regional variations, with some operators running no services at all. During the RMT's action on Friday about half of the network is set to shut down.", "Aslef drivers will walk out again on Saturday, affecting the first ever all-Manchester FA Cup final at Wembley and the Scottish Cup final at Hampden Park. ", "That strike will also affect Beyoncé's Renaissance world tour concert in London; the England v Ireland cricket Test match at Lord's; and some 100,000 horse racing fans travelling to Epsom for the Derby.", "National Express said it was providing 120 private coaches, with a seating capacity of 5,880, to take football fans to Wembley. These are for match ticket holders only, with seats bought via their club.", "But it added: \"Every time there is a rail strike, we see an increase in both enquiries and bookings across our UK-wide scheduled coach network... with a 30% increase in bookings for travel this week so far.\"", "Motoring organisation the RAC said it expected the roads to be \"exceptionally busy\", not least because the cup final coincided with the end of half-term in many parts of the country. ", "The AA warned that motorway service stations were \"likely to be incredibly busy\" on Saturday and advised non-football fans to consider taking a break elsewhere, such as in a local town or village.", "Mick Whelan, general secretary of Aslef, said train drivers were \"determined to get a resolution and remain in this for the long haul\".", "But he told BBC Radio 4's Today programme that \"zero\" progress had been made in negotiations with the Rail Delivery Group (RDG), which represents train operators, and accused the government of being underhand. ", "\"We go into talks in good faith, then deceitfully [the RDG] put out deals they know are destined to fail and we can't accept. ", "\"Ultimately, we'll have to solve this - after four years without a pay rise my members feel they're entitled to one, particularly during this cost-of-living crisis.\" ", "Business is also counting the cost of the long-running industrial action.", "Tristan Moffat, owner of the Piano Works bar in London, told the BBC \"nothing has hit us harder\".", "\"The train strikes really are crippling to the business, and in a time when we're already seeing so many businesses on the knife-edge and up against the wall we need a period of stability.\" ", "It is likely that evening services on some lines will be affected on the days before each strike, so passengers are advised to check the last train times on the evenings before strike days and the mornings following strikes.", "Mr Whelan denied this weekend's strikes had been planned to coincide with major events, adding that there was not \"a day in this country when there's not a pop concert or something going on\".  ", "But an RDG spokesperson said the walkouts would cause \"disappointment and frustration for tens of thousands of people\" and inconvenience families travelling for the half-term holidays. ", "A spokesperson for the Department for Transport added that the unions forced their members to miss out on pay every time they strike. ", "\"The government has facilitated a fair and reasonable pay offer, now union leaders must do the right thing and put this to their members,\" they added.", "Are you affected by the train strikes? Are you taking part in the industrial action? Get in touch.", "Both Aslef and the RMT say they have not been given a pay offer they can recommend to their members.", "The cost of living is rising at its fastest rate in nearly 40 years and unions say wages have not kept pace. ", "The most recent offer which Aslef's leadership has rejected involves a 4% pay rise in year one and a further increase of 4% in year two, conditional on the union accepting changes to ways of working.", "They include changes to driver training and Sunday working commitments, as well as giving employers control over rotas.", "The London Underground will not be affected by the action. "]}