{"title": "Elon Musk: Tesla boss on first China trip in over three years", "body": ["Tesla chief executive Elon Musk is in China, as he makes his first trip to the world's second largest economy in over three years.", "He arrived in Beijing on Tuesday and is also expected to visit Tesla's huge manufacturing plant in Shanghai.", "The multi-billionaire met China's foreign minister Qin Gang within hours of arriving in the country.", "Mr Musk has not yet publicly commented on the trip, which comes amid tensions between the US and China.", "He also declined to make any comments about his plans for the trip when asked by reporters as he left a hotel in Beijing on Wednesday.", "Later on Wednesday, Mr Musk met China's industry minister Jin Zhuanglong and discussed the development of electric vehicles.", "In a statement on Tuesday, China's foreign ministry said that Mr Musk was willing to expand the car maker's business in the country, which is Tesla's biggest market after the US.", "The ministry added that during the meeting Mr Musk had described the economies of the US and China as \"conjoined twins\".", "Tesla did not immediately respond to a BBC request for comment.", "Mr Musk has also been uncharacteristically quiet on Twitter, which he owns and where he has more than 141 million followers.", "He is known for tweeting many times a day but as of midday on Wednesday had not posted anything since arriving in the country on Tuesday afternoon. ", "The social media platform is banned in China but it can be accessed through VPNs, or Virtual Private Networks.", "Mr Musk is the latest high-profile US executive to make a trip to China. JP Morgan chief executive Jamie Dimon is also in China this week, while Apple boss Tim Cook visited the country in March.", "However, as tensions rise between Washington and Beijing Tesla finds itself in a difficult position, Dan Ives from investment firm Wedbush Securities said.", "\"Playing nice in the sandbox in Beijing is something Wall Street is laser focused on, to make sure there are no disruptions to Tesla's expansion within China for the coming years,\" Mr Ives added.", "In January 2019, Tesla started building its so-called gigafactory in Shanghai, which was the firm's first manufacturing plant outside the US.", "Later that year, it delivered its first Chinese-made cars, marking a major milestone for the American company.", "However, Covid lockdowns across the country, including in the financial, manufacturing and shipping hub of Shanghai, made it increasingly difficult for manufacturers to operate.", "Last year, Mr Musk said the coronavirus lockdown of Shanghai was \"very, very difficult\" for Tesla, which reportedly halted most of its production at its gigafactory for several weeks.", "Operations have since resumed at the plant, which produced its millionth car in August, according to Mr Musk. This accounted for a third of Tesla's global production.", "Last month, the company said it planned to build a new factory in China to make its large-scale \"Megapack\" batteries.", "China has also become the largest market for Tesla's Model Y mass-market electric vehicle, according to market research firm JATO.", "More than 94,000 Model Y vehicles were sold in China in the first three months of this year, putting it ahead of the US and Europe, JATO data shows.", "In recent years, Tesla's lead in electric vehicle market has been challenged by increased competition from car making giants, including Ford and General Motors, as well as newer entrants into the market like China's BYD and Nio.", "Mr Musk - who bought Twitter last year for $44bn (£35.5bn) - has been under pressure to find someone else to lead the company and refocus his attention on his other businesses, including Tesla and rocket firm SpaceX.", "Earlier this month, he named Linda Yaccarino, the former head of advertising at NBCUniversal as the platform's new chief executive.", "Ms Yaccarino will face the challenge of running a business that has struggled to be profitable, while facing intense scrutiny over how it handles misinformation and hate speech.", "Twitter is now worth around a third of what Mr Musk paid for it, according to financial services firm Fidelity Investments, which helped to finance his takeover of the company."]}