{"title": "People urged to cash in unused energy bill support vouchers", "body": ["Households with prepayment meters are being urged to make sure they have cashed in all their energy vouchers before the end of June.", "The government says that while more than four in five vouchers have been used, £130m is still available.", "The voucher scheme provides support of £400 per household.", "Customers are being told to contact their electricity supplier over the next few weeks if they have any issues with their vouchers.", "The Energy Bills Support Scheme was announced by the government last year, and provided £400 to each household in Britain to help with the cost of soaring gas and electricity bills.", "The government, charities, consumer groups and energy suppliers are issuing a combined call for those eligible to claim the help they are entitled to, before the vouchers expire on 30 June.", "Amanda Solloway, the minister for energy consumers and affordability, said the government was \"redoubling our efforts to reach anyone who still hasn't claimed this help\".", "Most of the homes in England, Scotland and Wales pay their energy bill by direct debit and, from October, saw about £66 a month knocked off their bills for six months or credited to their account automatically.", "However, the system has not been so straightforward for the two million households that have a traditional prepayment meter for their gas or electricity. They have received the support through six vouchers, each worth £66 or £67, in the post or via email. ", "The vouchers then need to be taken to a local PayPoint store or a Post Office to be credited onto a meter. ", "Charities have been urging people to cash in their vouchers, as many households with traditional pre-payment meters are considered among the most vulnerable.", "Matthew Cole, head of the Fuel Bank Foundation, said the charity was \"really concerned\" that hundreds of thousands of people could \"miss out on this vital financial support\".", "It found that some of the reasons why have not been redeemed included people not receiving them, due to incorrect address details, or vouchers having been lost or deleted.", "Emily Seymour, Which? energy editor, said \"any lost, missing or expired vouchers can be reissued, as long as they are redeemed by 30 June 2023\".", "\"If you are on a traditional prepayment meter and haven't received your vouchers, are unsure of how to redeem them, or need a voucher to be reissued, you should get in touch with your supplier for more information,\" she added."]}