{"title": "Vision Pro: Apple's new augmented reality headset unveiled", "body": ["Apple has unveiled a much-anticipated augmented reality headset, Apple Vision Pro, in its first major hardware launch for almost a decade.", "Apple CEO Tim Cook said the new headset \"seamlessly blends the real world and the virtual world\".", "The tech firm also announced its latest iPhone operating system, as well as updates to MacBook Air.", "The headset has a two-hour battery life, costs $3,499 (£2,849) and will be released early next year in the US.", "The cost is considerably more than virtual reality headsets currently on the market. Last week Meta announced its Quest - which costs $449.  ", "Apple said little about generative artificial intelligence - the buzzy technology that is the talk of Silicon Valley. ", "The company's share price fell slightly during the announcement, made at a developer's conference at Apple Park, the company's headquarters, in Cupertino, California.", "The BBC is among the media outlets at the event, but has yet to try out the new device.", "Apple Vision Pro looks different to similar headsets on the market - and is more reminiscent of a pair of ski goggles than a virtual reality headset.", "Apple used the phrase \"augmented reality\" to describe what the new device does. ", "Augmented reality, also known as mixed reality, superimposes virtual objects in the world around us - enabling us to mix reality with virtual reality by looking through a screen.", "Users can access apps, watch movies, and write documents in a virtual world. But so far, there is little evidence of a big market for this kind of wearable tech.", "Hartley Charlton, senior editor of MacRumors, was unsure how much the headset would appeal to the general public.", "\"It won't appeal to mainstream consumers at first on account of its extremely high price point and immediate shortcomings as a first-generation device,\" he said, \"such as its separate wired battery pack.\"", "But he said Apple has a track record of \"overcoming scepticism\" about new devices, and has historically encouraged people to \"part with their cash to add a new gadget to their repertoire\". ", "In his sales pitch, Mr Cook said the headset allows users to \"see, hear and interact with digital content just like it's in your physical space\".", "It is controlled by using a combination of your hands, eyes and voice - such as tapping your fingers together to select, and flicking them to scroll.", "The announcement comes a week after Meta and Lenovo announced new iterations of their pre-existing virtual-reality headsets, that do not superimpose objects onto a view of the real world.", "Meta has also invested heavily in mixed reality - but right now the sector is struggling. ", "The headset market saw a 54% drop in global sales last year, according to the International Data Corporation.", "Apple's last major hardware release was for the Apple Watch device in 2015.", "Aside from the Vision Pro announcement, Apple also unveiled iOS17, the latest version of its iPhone operating system.", "Updates include \"contact posters\" - a picture or image of yourself that will appear on a person's phone when you call them - and \"live voicemail\" - which provides a real-time transcription of an answerphone message being left to you.", "This transcription will also apply to audio messages left using Apple Messages. ", "And Apple has introduced a system called Check-In - which will automatically tell a friend or family member when you've arrived home. ", "If your journey is substantially delayed, it has the power to tell others that you have not made it home safely yet.", "The new operating system will be available in Autumn 2023.", "Additional reporting by Shiona McCallum"]}