{"title": "F1: Finding Vettels of the future on the eSports circuit", "body": ["Not many people can say they've raced against Formula 1 champion Sebastian Vettel and won. ", "But it's a boast Lucas Blakeley can make.", "He's also a racing superstar, but you probably haven't heard of him.", "That could be because the Scottish esports athlete can usually be found on the virtual track - although his victory over Vettel was in a real car.", "The pair's Race of Champions face-off in January was the latest example of how lines between the real and gaming worlds in Formula 1 are blurring.", "And it's something racing team bosses say is helping them to find the stars of the future. ", "Lucas now races for McLaren's esports team, competing in a global virtual Grand Prix. ", "Now in his twenties, he got into go-karting at seven years old and quickly realised he wanted to be an F1 driver.", "Lucas says Lewis Hamilton winning the championships in 2007 inspired him further, but the sport was just too expensive for him to break into.", "\"That's the harsh reality for many racing families out there,\" he says.", "Lucas got a second chance when F1 launched its own esports tournament in 2017, providing another route into competition.", "Last year, racing under the McLaren banner, he was crowned World Champion, starting his final race in pole position and retaining his lead throughout.", "Drivers compete in complicated simulator rigs, with the same controls as most racing cars and screens covering drivers' front and side views.", "The races are major competitions, watched by fans worldwide on streaming platforms like Twitch. ", "According to the esports company Gfinity, more than 45 million people watched at least one race in 2022.", "And with all those eyes on you, \"the pressure is immense\", Lucas tells BBC Click. ", "\"Mentally that's the hardest part, the results in F1 esports can change in a literal flash of an eye,\" he says.", "\"You also learn about yourself. How do you react to pressure? How does your body respond? How does your mind respond?\"", "McLaren is just one of the big F1 teams putting attention on esports, with the biggest names like Red Bull, Mercedes and Ferrari all taking part. ", "The hope is that getting signed will become more accessible.", "Qualification rounds use copies of Codemasters' F1 game, with the best players invited to scouting sessions watched by reps from the big name teams.", "Some racing teams now see virtual racing as an important part of their future, attracting new talent and making the sport appeal to a wider audience. ", "\"The F1 video game is the closest thing you can do to real-life racing without getting behind the wheel of a kart or a car\", says Lindsey Eckhouse, Director of Licensing and Digital Products at McLaren Racing. ", "She says gaming can help train up F1 stars of the future, as the virtual and physical worlds come together.", "\"As we blur those lines further and further, that's an exciting sort of area, really building up the next generation of talent that comes into the sport.\"", "The 2023 series is now underway, with the next champion set to be crowned before the end of the year. ", "And with a new version of the F1 game out this month, the biggest racing brands will be hoping more aspiring esports champs get behind the virtual wheel. ", "Follow Newsbeat on Twitter and YouTube.", "Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here."]}