{"title": "Who is Linda Yaccarino, Twitter's 'superwoman'?", "body": ["Why would anyone want to leave a plum post at one of America's biggest media companies to take a chance leading Twitter, a social media platform with a spotty business record and an infamously mercurial owner?", "Enter Linda Yaccarino, a 60-year-old New York native widely respected in the advertising industry, who not only took the job, but started it a few weeks early.", "\"She's someone who really likes to be superwoman,\" says marketing veteran Lou Paskalis, who has known Ms Yaccarino for more than two decades, and describes her as fierce, shrewd and ambitious. She would jump at the chance, he says, \"to step in... and say, 'I can fix this'\".", "Which begs the question: can she?", "Even before billionaire Elon Musk took over Twitter last year, the social network had problems.", "It has been fiercely criticised, by the left and right, for how it polices misinformation and hate speech, and the business has struggled to break even - making an annual profit just twice since its launch in 2006.", "Growth, whether measured by users or the money it brings in, has been bumpy.", "Since Mr Musk took over the platform last year, the issues have only gotten worse.", "He has cut 75% of its former staff, including teams charged with tracking abuse; changed how the company verifies authentic accounts; and sparked debate with his own tweets spreading conspiracy theories.", "Advertisers have left in large numbers and users also appear sceptical. A recent poll by Pew found that six in 10 adults in the US, Twitter's largest base, were taking a break and a quarter said they did not expect to be using the app in a year.", "Even Mr Musk has seemed daunted by the challenges, going through with his $44bn purchase last year only under threat of a lawsuit. He has joked that only someone \"foolish\" would want the chief executive title from him.", "Ms Yaccarino appears undaunted. ", "Raised in an Italian-American family, the daughter of a police officer has risen through the ranks of some of the biggest media companies in the US, forging a reputation as a high-heeled and hard-charging executive, who has helped steer entertainment giant NBCUniversal through the upheaval wrought by the growth of the tech giants.", "At NBCU, home to brands such as NBC News, Focus Features and Bravo, Ms Yaccarino overhauled the ad sales business, pushed the 2020 launch of its ad-supported streaming platform Peacock, and drove industry-wide debates about data gaps as audiences migrated online. ", "The mother-of-two, who met her husband Claude Madrazo on a blind date and became a grandmother last year, was known to want some kind of promotion after a decade at NBCU where she was chairman of global advertising and partnerships. ", "There was widespread speculation about her interest in Twitter, especially after she defended Mr Musk at a conference last year, urging critical advertisers to \"give the guy a minute\". ", "\"I've long been inspired by your vision to create a brighter future,\" she tweeted after her new post was announced. \"I'm excited to help bring this vision to Twitter and transform this business together!\"", "By hiring Ms Yaccarino, Mr Musk has \"purchased trust\" from advertisers, says Mr Paskalis, chief executive of AJL Advisory.", "Indeed, industry giant GroupM, who represents brands such as Coca-Cola and Nestle, has already said it sees the platform as less risky.", "But repairing Twitter's business will be no small task. ", "Though big ad buyers are eager to have choices beyond the tech giants, the platform remains too small to be a must-buy, says long-time media analyst Brian Wieser, now principal at consultancy Madison and Wall. ", "Beyond advertising, she will also face a host of pressing issues: regulatory scrutiny of Twitter's hate speech and privacy controls; lawsuits from landlords, vendors and former staff over unpaid bills; not to mention user complaints and basic tech glitches, like the malfunctions that plagued the high-profile interview with Republican presidential candidate Ron DeSantis hosted on the platform. ", "The biggest wild card of all, of course, is Mr Musk, who has said he intends to remain involved at the site, overseeing products and technology. ", "\"Anybody taking this job has been set up to fail - it's not specific to her,\" Mr Wieser says. \"The question is whether or not the odds are more likely to be in her favour than any alternative. And yeah, actually the odds are more favourable.\"", "Friends and former colleagues say they expect Ms Yaccarino to use her background in television to improve the platform's ad business and expand the use of video across the site. ", "She has called Mr Musk's vision of Twitter as a starting point for an \"the everything app\", offering messages, payments and other functions a \"great opportunity\" for advertisers.", "\"[She has] the guts and the courage to take big swings,\" says Jacqueline Corbelli, founder and chief executive of Brightline, a tech company focused on streaming adverts, which has partnered with NBCU. ", "\"If Twitter gives her the space to do it, she will bring the ability to integrate what's been successful in the past and blend that with what advertisers are going to be looking for to regain trust in Twitter.\"", "Whether Ms Yaccarino will have room to run remains a big if.", "Some commentators have already suggested she is poised to encounter the \"glass cliff\" - a phenomenon in which women reach positions of power only at the riskiest moments.", "\"As someone used to wearing 4 inch heels, let's be crystal clear: I don't teeter,\" Ms Yaccarino shot back on Twitter recently, in response to such analysis.", "At an industry conference before her appointment, Ms Yaccarino, whose politics have been described as conservative but not ideological, pressed Mr Musk to explain what Twitter's \"freedom of speech, not freedom of reach\" meant and how it differed from rules at other companies.  ", "She also asked Mr Musk if he would curb his own tweeting, although she got little firm commitment, at least publicly, in response. ", "\"I'll say what I want even if it costs me money,\" he told CNBC recently.", "Friends say Ms Yaccarino, who has described her strategy for dealing with difficult colleagues as \"patience and wine\", is entering her new role clear-eyed about the risks.", "\"Linda is not afraid,\" says Shelley Zallis, chief executive of the Female Quotient, which works to advance women in the workplace, and whom Ms Yaccarino has described as a \"soul sister\".", "\"Linda is fierce and fearless and Linda looks for the solution.... She really is a person that will bring the industry together and push forward progress.\""]}