{"title": "5G: York anti-vaccine protester jailed over phone mast plot", "body": ["An anti-vaccine conspiracy theorist has been sentenced to 12 months in prison for plotting to destroy 5G masts.", "Christine Grayson, 60, joined an online chat group in 2021 after \"becoming obsessed\" with the belief they were linked to the Covid-19 vaccine.", "Leeds Crown Court heard she was a grandmother \"of previously good character\" who will be released after spending nine months on remand. ", "Her co-defendant Darren Reynolds, 60, was also jailed for terror offences. ", "Reynolds, of Newbould Crescent, Sheffield, had been cleared of conspiracy to commit criminal damage in relation to 5G masts, but found guilty of terrorism offences. ", "He was jailed for 12 years, with an additional year on licence, after being found guilty of offences linked to his \"extreme right wing, antisemitic and racist views\".", "Grayson, of Boothwood Road, York, had met Reynolds on the social media platform Telegram. ", "The court heard both defendants were strongly opposed to the roll-out of the 5G network - but Grayson had discussed \"getting rid\" of the mobile phone masts with expanding foam and angle grinders.", "She was found guilty of conspiracy to commit criminal damage, while Reynolds was cleared of that charge. ", "He was found guilty of eight terrorist offences. ", "The court heard Reynolds discussed armed uprisings and advocated violence towards people he called \"traitors\".", "His comments included describing Parliament as \"a nest of Jews, foreigners and collaborators\" and repeatedly calling for MPs to be hanged.", "His defence claimed his actions were no more than \"free speech gone completely wrong and the line crossed\".", "Lee Karu said there was no evidence anyone had been encouraged by Reynolds.", "However, Judge Kearl said he had \"applauded the callous murders\" of MPs Jo Cox and Sir David Amess.", "The judge said: \"Your offending took place through an internet chat room group - you had set it up and you were the administrator. ", "\"Many of the views you expressed were racist and grossly offensive to most right-thinking people.", "\"I am satisfied that it was not \"just hot air\", your message was consistent and persistent, and you were calling people to arms.\"", "During their trial, the court heard how police had found a crossbow and a number of crossbow bolts at Grayson's home, while at Reynolds' they discovered two replica assault rifles.", "Reynolds was told he would automatically become a registered terrorist offender. ", "Sentencing Grayson, Judge Kearl said: \"You chose to take the law into your own hands and you discussed the methods of damaging the masts in an internet chat group.\"", "He said the methods she discussed were damaging the masts with fire or by \"inserting expanding foam into the structure\". ", "He said she \"knew there were ways she could express her views in a lawful manner\" and said her actions showed an intention to cause serious damage.", "Grayson was told she would be released on licence, but failure to comply and she would be returned to prison to serve the remainder of her sentence. ", "Follow BBC Yorkshire on Facebook, Twitter and Instagram. Send your story ideas to yorkslincs.news@bbc.co.uk."]}