{"title": "Linda Yaccarino replaces Elon Musk as Twitter boss", "body": ["Linda Yaccarino, the new boss of troubled social media firm Twitter, has started the role earlier than expected.", "Ms Yaccarino, previously head of advertising at NBCUniversal, joined days after Twitter lost its second head of trust and safety.", "Elon Musk had announced on 12 May that his successor would join in six weeks but her start date appears to have been brought forward.", "Twitter also announced it had recruited Joe Benarroch from NBCUniversal.", "Mr Benarroch was senior vice president of communications, advertising and partnerships at the media giant. ", "He also worked for a number of years at Meta, the company behind Facebook and Instagram. At Twitter he will focus on business operations.", "Mr Musk has said he plans to remain involved with the firm. ", "The billionaire owner of Twitter said last year he would resign as chief executive once he found \"someone foolish enough to take the job\". ", "It followed a Twitter poll when Mr Musk asked people to vote on whether he should resign - 57.5% voted yes.", "Ms Yaccarino welcomed her former NBCUniversal co-worker Mr Benarroch to Twitter, which is known for its logo of a bird.", "She tweeted: \"Welcome to the flock @benarroch_joe! From one bird to the next.\"", "He said: \"I am looking forward to bringing my experience to Twitter, and to working with the entire team to build Twitter 2.0 together.\"", "Ms Yaccarino, who is 60 years-old, will oversee business operations at the platform, which has been struggling to make money.", "Since buying Twitter, Mr Musk cut 75% of its employees including teams charged with tracking abuse and changed how the company verifies authentic accounts. ", "Meanwhile, advertisers have left in large numbers.", "Ms Yaccarino is credited with helping to steer NBCUniversal through the upheaval caused by technology firms. ", "In her former role, she overhauled the ad sales business, pushed the 2020 launch of its ad-supported streaming platform Peacock, and drove industry-wide debates about data gaps as audiences migrated online.", "Late last week, reports emerged that Twitter's second head of trust and safety under owner Mr Musk had resigned. ", "Ella Irwin took the post when previous head Yoel Roth left in November 2022 - a month after Mr Musk took over the company.", "The head of trust and safety is tasked with content moderation, a topic which has come under the spotlight since Mr Musk's takeover of the firm.", "The reason for Ms Irwin's resignation is unclear. However, it came a day after Mr Musk publicly criticised a content moderation decision made at Twitter.", "Since buying Twitter for $44bn (£35.4bn), Mr Musk had been under pressure to find someone else to lead the firm and refocus his attention on his other businesses, which include electric carmaker Tesla and rocket firm SpaceX.", "He will continue as Twitter's executive chairman and chief technology officer."]}