{"title": "Love Island 2023: Is the reality series past its prime?", "body": ["It has been a matter of weeks since the last Love Island winners were crowned, but it is once again time to open those villa doors.", "Series 10 of the ITV2 dating show kicks off on Monday evening and producers will be hoping it proves more popular with viewers than its winter iteration. ", "Despite the positive reaction to new host Maya Jama, the show recorded lower audiences and less online commentary than previous series.", "The opening episode drew 1.2 million viewers, half the audience of the 2022 summer series' first night.", "One big change implemented for 2023 was ITV's ban on contestants' social media being run by friends or family while they were on the show.", "This policy of leaving accounts dormant was introduced to protect islanders and those close to them from online bullying and abuse.", "Pop culture and reality TV writer Nikki Onafuye says the downside is that savvy contestants could no longer capitalise on well-managed accounts to help boost popularity or engagement in the show.", "\"The appeal of Love Island is the talk on Twitter at 21:00 every night,\" she told the BBC.", "\"Not having friends or family handle your social media does hinder you - you'll remember [2022 contestant] Ikenna Ekwonna's cousin was tweeting the funniest things, creating reactive content and trending on Twitter.\"", "Ms Onafuye, 27, said the appetite for the show has certainly dwindled in her friendship group, mostly because they are no longer the same age as the show's contestants. ", "\"[In 2017] we'd watch the series because we were looking for love, we'd see romance on screen and hope we'd one day end up having that,\" she said.", "\"But now our age group has experienced those different relationships and we can see that what happens on Love Island doesn't happen in real life - it's fake to us.\"", "Ms Onafuye said her friends still love reality TV but are turning their attention to shows such as Love Is Blind or Married at First Sight.", "\"My friends are entering into a new part of their life - we're thinking about houses, kids and marriage and I think the core audience of Love Island are too.", "\"With these dating shows, you're seeing genuine relationships where people are more interested in listening to people, not just looking at physical attraction,\" she said.", "Love Island's viewing figures peaked between 2017 and 2019 - with about 3.5 million people tuning in each night.", "The most popular islanders would often leave the villa with more than a million followers on Instagram, giving them an instant platform to launch a career as an influencer. ", "Contestants such as Olivia Attwood in 2017, Dr Alex George in 2018 and Molly-Mae Hague in 2019 became household names for many. ", "ITV's new social media rules seem to have ended the overnight success many previous contestants enjoyed, with many series nine cast members leaving the show with about 100,000 followers. ", "Talent manager Jemma Epstein, who works with content creators at The DDA Group, says this makes things \"more fair\". ", "\"People from completely different industries go on a reality TV programme and come out [and] are offered incredible money and major brand deals, when their content before was just selfies in the mirror,\" she told the BBC.", "She said reality TV contestants can struggle to come across as \"genuine and authentic\" because they will often promote fast fashion companies and other brands that do not showcase their individuality or personal interests.", "\"[Contestants] won't be aware of what's going on with their accounts that friends back home are running, they'll just sign up to a management agency and set up big brand endorsements on their behalf,\" she added.", "Ms Epstein said that in spite of ITV's new social media rules, the reality TV influencer model has been losing popularity for a while as consumers look for more authenticity online. ", "\"The creators we look after aren't here for fame, they want to provide a really positive, uplifting message to inspire and help people,\" she told the BBC.", "\"We want to make sure our creators inspire their audiences, are motivational and only promote products they are passionate about as opposed to accepting deals for the sake of money.\"", "She added that her agency is \"open\" to working with reality stars, but that it depends on their goals and \"what type of work they want to be doing\".  "]}