{"title": "YouTube stops deleting false 2020 election claims", "body": ["YouTube will stop removing videos with false claims of fraud in the 2020 presidential election, the social media platform announced on Friday. ", "The move, ahead of the 2024 elections, is a reversal of its policy put in place after the 2020 vote.", "The company said it has deleted tens of thousands of videos questioning the integrity of past elections, but now \"it was time to re-evaluate\". ", "The policy goes into effect from 2 June.", "YouTube and other social media platforms have faced intense pressure since the 2016 elections to safeguard against political misinformation.", "The Google-owned platform says the new policy is being put into place because of today's changed landscape.", "\"In the current environment, we find that while removing this content does curb some misinformation, it could also have the unintended effect of curtailing political speech without meaningfully reducing the risk of violence or other real-world harm,\" the company said in a statement. ", "YouTube said it would continue to tweak its policies in advance of the 2024 election, but did not provide specifics about what led to the policy change. The BBC has contacted the company for comment. ", "The company added that it will continue to enforce other election misinformation policies - for instance, videos that include misleading instructions on where or how to vote. ", "The election fraud policy was enacted in December 2020 and led to the deletion of a video posted by Donald Trump on 6 January 2021 telling protesters to leave the US Capitol. That video fell afoul because Trump also repeated his false claims of widespread fraud. ", "\"This was a fraudulent election, but we can't play into the hands of these people,\" Trump said in the clip. \"We have to have peace. So go home, we love you, you're very special.\"", "A video posted by a US congressional committee investigating the Capitol riot was deleted in 2022 because it too contained a clip of Mr Trump repeating election falsehoods. ", "The company lifted restrictions on Mr Trump's YouTube channel - which has more than 2.7 million subscribers - in March of this year. ", "Since then, the former president has posted around 20 short clips in support of his campaign."]}