{"title": "Brighton: Poor mobile coverage causes stress and anxiety", "body": ["Brighton residents claim poor mobile phone coverage is causing them frustration, stress and anxiety.  ", "Customers on O2 and Giffgaff, which run on the same network, say they have had issues accessing data for months. ", "O2 has apologised to customers experiencing intermittent service issues and said it was \"working to boost capacity and ease congestion\". ", "The provider has installed a new temporary mast and has plans in place to build a second. ", "However, they could not provide a completion date for this and said obstacles outside of their control, such as planning issues, could make it a \"lengthy process\". ", "Brighton and Hove City Council said it was not aware of any planning applications from O2, but noted that not all phone masts need planning permission. ", "The beach and surrounding streets seem to be a particular blackspot for 4G, although there have been reports of poor coverage across the city. ", "Emma Cohen, an O2 customer, has a visual impairment and said not being able to access data \"adds a layer of complexity if you're making plans\".", "She said when she meets up with someone, if she cannot see them she messages them on WhatsApp. ", "\"If I can't get through it's an added stress and it gives me anxiety,\" she said. ", "Lack of access to data also makes it difficult for Ms Cohen to plan a journey, as bus and train tickets are now frequently purchased online.", "She also has problems using Google Maps, which she relies on for route planning. ", "For some, the lack of coverage is causing difficulties at work. ", "Laura Kelsey, also on O2, is a head teacher. She has to be on call all the time and finds it difficult to download and read emails.", "\"When I'm out and about, I can't rely on my phone,\" Ms Kelsey said. \"It's frustrating because it's a major city and it should work.\" ", "Sophie Adler is on Giffgaff and runs a catering business. ", "She has faced similar problems with emails, which often means she cannot contact clients when out and about.  ", "Recently Ms Adler was out shopping when she realised her bank card was blocked. ", "She needed to unblock it using online banking, but a lack of data coverage meant she was unable to do so. ", "\"There was nothing I could do until I got to wi-fi,\" Ms Adler said.  ", "Follow BBC South East on Facebook, on Twitter, and on Instagram. Send your story ideas to southeasttoday@bbc.co.uk. "]}