{"title": "Spider-Man: Across the Spider-Verse opens ground-breaking franchise to female fans", "body": ["For the first time in many years, in an alternate universe known as Earth-65, Gwen Stacy is taking centre stage.", "Her introduction as Spider-Woman, also known as Ghost Spider or Spider-Gwen, breaks new ground in one of the world's most successful superhero franchises.", "She is the student bitten by the radioactive spider, developing super-powers including huge strength, endurance and speed, plus the ability to stick to any surface. ", "Critics are already effusively praising Across the Spider-Verse, the sequel to the Oscar-winning animated 2018 movie that introduced the first Black Spider-Man, Miles Morales.", "The trilogy's final instalment, Beyond the Spider-Verse, is out next year.", "Studio executives are also reportedly planning new live action films focused on Morales and Spider-Woman.", "The starring role of Spider-Woman, voiced by actress and singer Hailee Steinfeld, who was Oscar-nominated for True Grit aged 14, means female fans are able to see themselves in a whole new light as the webbed heroine.", "Spider-Man is one of the most enduring and popular superhero characters of all time. There have been 11 film versions and acclaimed video games including a new Playstation release that will allow players to switch between Peter Parker in the Venom suit and Miles Morales. ", "A fourth Spider-Man film featuring the box-office winning combo of Tom Holland and Zendaya is also in the works, but has seen development paused by the ongoing Hollywood writers' strike, according to producer Amy Pascal in an interview with Variety. Their last movie Spider-Man: No Way Home made more than $1.9bn worldwide.", "Meanwhile, Across the Spider-Verse has had strong advance sales and is forecast to rake in as much as $100m during its opening weekend in the US.", "Five years ago, Spider-Man: Into the Spider-Verse took the bold step of experimenting not just with a new Black web-slinging hero, but in its use of a variety of animation techniques not seen before on the big screen.", "Some critics said it would be hard for a sequel to top the ground-breaking look and feel of the 2018 original. ", "But the highly anticipated film, which has a runtime of nearly two and a half hours, appears to have swerved that fate.", "The TV and film review aggregator website Rotten Tomatoes said it's earned an \"exceptional\" score with a critic \"declaring it a bigger, better, and more visually stunning movie - perhaps one of the best sequels of all time\".", "BBC movie critic Nicholas Barber had a more mixed take but writing on the BBC Culture website that \"the cleverness and craftsmanship are so staggering that they make the directors of every other animation seem as if they aren't trying\".", "He called the 2018 original a 'game-changer' as the \"first to exploit the idea of alternate universes, and the only one to reproduce the variety of visual styles and techniques that you can see when you flip through a stack of comics.\"", "The success of the comic book movie adaptation means it appears Sony Pictures is striking gold with the Spider-Man franchise following big box office disappointments including Morbius and Babylon.", "Sony Pictures owns the copyright to the character and Spider villains, but loans them out to Marvel for their movies.", "Ultimately what matters most is whether audiences love the film and if big bucks can be made off an expanded franchise.", "At MCM London Comic-Con, which took place this past weekend, there was nothing but excitement among fans and comic artists for Across the Spider-Verse.", "The industry event attracted about 100,000 people over three days, and the most ubiquitous costume spanning every age, gender and ethnic background was Spider-Man.", "Thirteen-year-old student Cleo, pictured above, is a fan of the entire Marvel universe, but came dressed as Spider-Gwen having pre-ordered her costume online.", "\"I've been watching the trailer and going yay she's here,\" Cleo told the BBC. \"We're introducing femininity into the Spider-Verse\".", "There was also a noticeable number of young, black children dressed as Spider-Man and identifying directly with Miles Morales. ", "One of them, eight-year-old Nathaniel, already has tickets to a screening and said he loved the character's origin story, superpowers and the 2018 movie's music and animations. ", "His dad, Samuel, then gave him a gentle nudge and said: \"It's okay, you can say what you said in the car\". Nathaniel then shyly replied: \"It's also because he's the first black Spider-Man\".", "British comic book artist Mike Perkins has worked exclusively with Marvel Comics in recent years, including on Spider-Man, Fantastic Four and Captain America.", "He believes Spider-Man has universal appeal because his origin story showed a \"little kid who wasn't in the greatest position in life\" but went on to become one of the world's greatest superheroes. ", "He recalled he was on a plane when he first watched the original \"astounding\" 2018 animation and now has high expectations for the sequel.", "\"I was just so shocked,\" he told the BBC at Comic Con. ", "\"I mean, the style. You're so used to superhero animation, which is very staid, in a way... And it just made it incredibly vibrant... it just punched everything out. ", "\"Everything was flowing so beautifully between the different scenes and the action in a way you didn't feel like you were watching an animation.\"", "He added: \"You have so much Spider-Man history to go on. There's so much that they can mine for entertainment.", "\"I don't think they'll ever run out of ideas. And especially if they're opening up that whole multiverse thing.\"", "He finds the diverse cast and approach \"wonderful\", sharing that his daughter \"isn't really into Spider-Man stuff\" but that he hopes she'll change her mind after seeing Gwen Stacey as Spider-Woman. ", "\"I tried for the longest time to get my daughter into Doctor Who and she wasn't very interested. And then Jodie [Whittaker] became a Doctor. And my daughter was like, 'oh, it's a girl'. And then from that she went back and re-watched [the series] and she's she's just a Big Doctor Who nerd now. ", "\"That kind of attraction of seeing yourself portrayed on the screen is a big pull. And that's one of the good things with the Spider-Verse is everybody will be able to see themselves.\"", "Rubies is the official costume retailer for Spider-Man and Spider-Woman, and Helen Arblaster, from its marketing team, told the BBC that Spider-Man is its most popular superhero costume. ", "They now expect strong demand for the female versions. ", "\"I'm excited for Spider-Gwen and having female characters in the Spider universe, because we have so many little girls who have been dressing up as a Spider-Man character\".", "Spider-Man: Across the Spider-Verse is released in cinemas in the UK on 2 June. "]}