{"title": "UK government largely run on WhatsApp says ex-comms chief", "body": ["The UK government is \"largely run by WhatsApp\" according to Boris Johnson's former communications chief, as the deadline for the ex prime minister's unredacted messages looms.", "Guto Harri said it is sign that political communication has changed.", "Mr Johnson is urging the government to hand the material to the Covid inquiry in full without redactions.", "The public hearing, which begins in two weeks, is investigating how ministers handled the pandemic.", "Mr Harri, the Welsh former Downing Street head of communications, told Radio Wales that the global pandemic had \"blurred the boundaries\" between official communication and conversations on sites like WhatsApp.", "WhatsApp allows users to send messages, images, audio or video.", "\"Long gone are the days where a person with a clipboard would sit there writing the official record. The decisions that have to be taken, the number of people involved and we had a global pandemic where people were rarely in the same room,\" he said.", "Mr Harri said that using the instant-messaging service helped the government to function more efficiently, adding: \"It will surprise people but that is the pace of government now.\"", "The UK government has so far refused to hand over material it does not consider relevant.", "The Covid inquiry has given the Cabinet Office until 16:00 BST on Thursday to disclose all of the information it has requested. ", "The Cabinet Office has argued that ministers must have the right to discuss policies in private and says a leading lawyer is in the process of deciding what is relevant to the inquiry.", "Some senior Conservative MPs have urged the government to back down to avoid a lengthy legal showdown. ", "Mr Harri says the confusion has left people trying to work out \"where the bottleneck lies\".", "\"I suspect most people will be surprised that Boris Johnson is so willing to hand over his WhatsApp messages, because that puts pressure on the government to put pressure on other ministers, and the current prime minister,\" he said."]}