{"title": "Metal Gear Solid 3 remake: Voice actors not invited back", "body": ["News of Metal Gear Solid 3 getting a remake was one of the headlines of last week's PlayStation Showcase.", "The announcement left fans with a big question - would the original cast be re-recording their roles?", "It seems not. Two actors who voiced major parts in the PlayStation 2 version have told BBC Newsbeat they've not been asked back into the studio. ", "And Konami's said it \"will reuse the voice lines from the original game with no changes\".", "Newsbeat contacted most of the English-language voice cast or their agents to ask if they'll be re-recording their parts.", "Neil Ross, who played main enemy Colonel Volgin, said he had heard nothing from Konami about the remake.", "Another co-star had a similar response, while Solid Snake actor David Hayter's representative hasn't yet responded.", "Konami initially said the remake, officially titled Metal Gear Delta: Snake Eater, would \"star the original voice characters\".", "Fans weren't sure if this meant they could expect recycled dialogue or new audio.", "Konami's US PR boss appeared to confirm the news when he told US tech site The Verge there would be \"no changes\" to the dialogue.", "MGS 3 is generally considered a classic, and its creator Hideo Kojima won't be involved in the remake for PS5, Xbox and PC.", "There was some concern any changes to the game's script or performances might have a negative effect.", "And a remake of the first Metal Gear Solid - Twin Snakes on the Nintendo GameCube - used new performances which many fans considered inferior.", "So some gamers are actually quite happy for the 2004 game's voice tracks to be left alone.", "There have been questions about whether MGS Delta will feel more like a remaster than a top-to-bottom remake. ", "Beyond some new screenshots, we're still waiting for more detail.", "Konami's promised a \"faithful recreation of the original story and game design\" with updated visuals and \"immersive sound\".", "Delta doesn't yet have a release date, but Konami plans to re-publish the first three Metal Gear Solid Games later this year as the Master Collection, Volume One.", "Follow Newsbeat on Twitter and YouTube.", "Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here."]}