{"title": "Remote driver car rental service launches in Milton Keynes", "body": ["A car rental service that delivers a remotely driven vehicle to the user has been launched in a city.", "The Fetch vehicle system has been tested in Milton Keynes for 18 months and will now be available to customers.", "For now, all of the cars are delivered with a safety driver in the front of the vehicle who can take over the controls if necessary.", "Chief executive Koosha Kaveh said: \"It's driverless but not autonomous - yet.\"", "Imperium Drive, the company behind the service where cars are controlled by an office-based operator, claimed it was the first of its kind in Europe.", "Although the cars currently have a safety driver, the firm hopes they will no longer be needed after about 18 months of further testing.", "The remote operator of the car has a 360-degree view of the roads using cameras built into the vehicle, as well as anti-crash safety systems in the operating software.", "Customers can hire the electric cars through an app and although they drive them as normal, the vehicles are delivered by a remote operator to any location within a four-mile (6.4km) radius of Milton Keynes city centre.", "When the rental period expires, the operator resumes control and brings the vehicle back to base.", "The cars have been tested on the city's roads for the last 18 months, completing more than 1,000 miles (1,609km) of journeys without a single collision, Imperium Drive said.", "Mr Kaveh said: \"There's still a human involved, but they're sitting in a control centre piloting the vehicle in the same way you would a drone.", "\"When fully autonomous, we think this system has the potential to replace private car ownership in the UK.\"", "However, a spokesman for the RAC said it was concerned that remotely driving a vehicle distances the driver from the potential road safety consequences \"in a video game-like manner\".", "Simon Williams added: \"Although the remote driver has a reasonable view in front and around them, by not being present in the vehicle they are - like it or not - somewhat disconnected from the reality of actually being behind the wheel. ", "\"There's also a risk they could be distracted by something in the room where they are located. ", "\"We also fear there could be serious consequences when this scheme is rolled out more widely and if the delivery distances were to be lengthened to take in faster roads.\"", "The Fetch car system has the backing of both the government and Milton Keynes City Council, which sees rental systems like this as a way of reducing the number of cars on the roads. ", "The council said it was \"supportive of any new technologies that can revolutionise the way we travel, making it more sustainable\".", "\"Driverless cars is just one of the solutions we're looking at along with larger shuttles that use similar technology. The idea is to make shareable transport more attractive,\" the authority said.", "Follow East of England news on Facebook, Instagram and Twitter. Got a story? Email eastofenglandnews@bbc.co.uk or WhatsApp us on 0800 169 1830"]}