{"title": "Wrestlers' protest: The fake smiles of India's detained sporting stars", "body": ["When a group of top Indian wrestlers were detained by the police during a protest on 28 May, two versions of a selfie taken by one of them began circulating on Twitter. ", "Both pictures show medal winners Vinesh and Sangeeta Phogat sitting inside a bus along with other detained members of the wrestling team, accompanied by three police officers. ", "The images are identical, except that in one of them, the wrestlers appear to be smiling. ", "Indian wrestlers have been protesting for more than a month after they accused the wrestling federation chief, Brij Bhushan Sharan Singh, of sexual harassment. ", "Mr Singh is a member of parliament from the governing Bharatiya Janata Party (BJP) and has denied the allegations. ", "The version with the smiling faces quickly went viral online, with posts carrying the manipulated image claiming the wrestlers were not serious about the protests and that it was all staged.", "Some BJP leaders and supporters also shared this image, although a few later deleted their tweets. ", "The opposition Indian National Congress accused the ruling party's social media unit, the BJP Information Technology (IT) cell, of tampering with the original image - although there has been no evidence of this.", "We've confirmed that the image of the smiling wrestlers first appeared online shortly after the original unsmiling image had been posted.", "A Twitter user shared the first image at 12:31 local time on 28 May - shortly after the wrestlers had been detained by the police. ", "The first manipulated image we've found appeared about 90 minutes later, accompanied by text in Hindi saying that the wrestlers should be ashamed of creating unrest just because they didn't want to participate in the national games.  ", "Using freely-available FaceApp software, we were able to generate exactly the same smiling image by using the original version as the initial image. ", "Shortly after manipulated image started to go viral, Olympic medal-winning wrestler Bajrang Punia- who has also been protesting in New Delhi - tweeted that the image was fake. ", "We contacted both  Vinesh and Sangeeta Phogat to ask why they'd taken the original photo. ", "Sangeeta messaged us to say: \"We were uncertain and scared about where they were taking us and we wanted to know who all had been detained along with us.\" ", "Benjamin Strick, Director of Investigations at Centre for Information Resilience and an open source investigator, says he's been following the wrestlers' protest. ", "He told us that the edited image was \"deeply impressive but also scary\" as it was easy to believe it was real unless you looked at it closely.", "\"There was a similar smile on all faces, full bright white teeth on all of them. The dimples on the cheeks were also a clue that the image was edited.\" ", "We searched for previous images of Vinesh and Sangeeta Phogat - neither of them have dimples and their teeth look different.", "While these small clues do work as red flags raising questions about authenticity, advances in technology are making it harder to differentiate fake from real. ", "\"In sophisticated edits, clues are unlikely to provide enough to be 100% sure,\" says Dr Sophie Nightingale, researching artificial intelligence at the University of Lancaster. ", "Indian fact-checker Pankaj Jain says this is what the future of disinformation looks like. ", "\"Until now, the fake ones could be caught by anyone, even a common man. In the future, this would be very difficult.\" ", "Additional reporting by Benedict Garman"]}