{"title": "Moscow drone attack: What we know about the strikes", "body": ["Russia says Ukraine launched \"a terrorist drone attack\" on Moscow on Tuesday, with several buildings damaged. ", "It is the first time Moscow has been so heavily targeted in a single operation, but Ukraine denies carrying out the strikes.", "The Russian military says eight drones were used in the strikes.", "It says five were shot down and three stopped with signal jamming technology - causing them to lose control and miss their  targets.", "By piecing together visual clues in video footage - such as building exteriors and parks - BBC Verify has confirmed the location of three drone strikes in south-west Moscow:", "We have also verified footage on the western outskirts of Moscow. It shows an unidentified drone flying over roofs in a village where affluent Muscovites live.", "\"We don't know what they were targeting yet, a proportion were intercepted by air defence systems, but some struck targets,\" Jack Watling, an expert on land warfare, told BBC Radio 4's Today Programme.", "Russia said it shot down five of the drones in the Moscow region with the Pantsir-S surface-to-air missile system. This system appeared to have been installed in central Moscow earlier this year.", "There was initial online speculation that the Ukrainian-manufactured UJ-22 drone had been used.", "However, we know the UJ-22 was not the drone pictured in several videos we checked. These drones have a different wing, wheel position and fuselage design.", "Instead, the drone pictured has a short set of wings at the front and larger ones to the rear. The unconventional design has prompted some to wrongly conclude that the aircraft was flying backwards, or that the footage was reversed. ", "We showed this video and images of the debris to drone specialist Steve Wright, of the University of the West of England, who said the wing span suggests a potential range of \"at least tens, even hundreds, of kilometres.\"  ", "\"However, as with the Kremlin attack on 3 May, I expect that it was launched much closer than that for tactical reasons,\" Mr Wright added.", "Several posts on social media have claimed that one of the weapons used to attack Moscow was a \"Beaver\" drone - a long-range attack aircraft said to be recently manufactured by Ukraine.", "Steve Wright cross-examined images of these drones against the verified footage of the strikes on Moscow. He concluded the two examples are consistent in design and the Beaver was \"most likely\" used.", "Elsewhere, a commercial plane flying over Moscow - a Cessna 172 - has been wrongly identified as a drone on the Telegram social messaging platform, popular in Russia.", "Throughout the war, both Russia and Ukraine have used commercially-sourced drones as well as established military designs.", "BBC Verify is working to identify the exact type of drones used in these reported attacks.", "Since the start of 2023, the BBC has tracked over 60 suspected drone attacks inside Russia and Russian-controlled territory in Ukraine.", "This includes an alleged attack on the Kremlin Senate building in central Moscow.", "However, most of the suspected strikes have focussed on the Bryansk and Belgorod regions in Russia near the north-eastern border, as well as in Crimea.", "Oil facilities, airfields and energy infrastructure have all been targeted.", "Layla Guest, an analyst at Sibylline security consultancy, says: \"Ukrainian forces will highly likely prioritise targeting oil refineries, as well as railway infrastructure and wider Russian logistics, to cause maximum disruption as part of their strategy ahead of the impending counter-offensive.\"", "Additional reporting by: Daniele Palumbo, Paul Brown and Tural Ahmedzade", "Read more about BBC Verify: Explaining the 'how' - the launch of BBC Verify"]}