{"title": "Gollum: Game mocked as developers Daedalic Entertainment issue apology", "body": ["The developers of the latest Lord of the Rings game, Gollum, have apologised after a major backlash from players.", "The action-adventure allows gamers to play as Gollum in a series of missions and locations.", "But reviews have generally been negative and players have mocked it online, with technical aspects and the game's stability being criticised. ", "Daedalic Entertainment have said they \"deeply regret\" that the game did not meet expectations.", "The release of The Lord of the Rings: Gollum comes six years after Middle-earth: Shadow of War, the last multi-platform, open-world Lord of The Rings game. ", "But players have been taking to social media platforms such as Twitter and TikTok to mock Gollum's technical bugs and glitches, whilst also pointing out how expensive the game is to purchase.", "The game was created by Daedalic Entertainment, a developer more commonly known for point-and-click adventure games, where the player typically controls their character through a point and click interface using a computer mouse.", "The creation of a large-scale game such as Gollum presents a very different challenge and a large international audience; something the developers have acknowledged.", "They said they consider creating a game set in Middle-earth as \"the greatest honour\" and the \"biggest challenge we have faced so far\".", "In a statement posted on Twitter, the developers said \"We would like to sincerely apologise for the underwhelming experience many of you have had with The Lord of the Rings: Gollum upon its release\". ", "\"We acknowledge and deeply regret that the game did not meet the expectations we set for ourselves or for our dedicated community.\"", "This isn't the first time this year that game developers have apologised for the poor performances of new releases on latest generation consoles.", "In April 2023, Respawn, the developers of Star Wars Jedi: Survivor, posted an apology on Twitter for the poor launch performance of the game on PC.", "In 2020, CD Projekt Red issued an apology after their game Cyberpunk 2077 suffered major performance problems on the PS4 and Xbox One.", "The continuous release of imperfect videogames has lead to a growing debate over whether players are getting a fair exchange for their money.", "The UK retail price of the Gollum game at initial release was £49.99.  ", "In a 2023 interview, the Zelda series producer Eiji Aonuma indicated that Nintendo decided to delay The Legend of Zelda: Tears of the Kingdom in March 2022 - to an unspecified 2023 date - solely to clean the game up to the finest condition.", "Aonuma told The Washington Post he had to announce its delay, \"to make sure that everything in the game was 100% to our standards\".", "The resulting game, Legend of Zelda: Tears of the Kingdom, sold faster than any Nintendo game in history.", "However, despite poor reviews and negative coverage online, the sales for Gollum are still high, with the game coming sixth in the UK Sales Charts on its release week.", "Daedalic have said they will continue to work on the game to \"address the bugs and technical issues many of you experienced\".", "\"We are committed to providing you with patches that will allow you to enjoy the game to its full potential,\" the statement continued.", "\"We understand that a game's success relies on the enjoyment and satisfaction of its players. ", "\"We genuinely value your feedback and have been actively listening to your voices, reading your comments, and analysing the constructive criticism and suggestions you have provided.\""]}