{"title": "What do we know about drone attacks in Russia?", "body": ["Russia says Ukraine has launched a series of drone strikes on its territory in recent months, including an attack on Moscow this week.", "It has also accused Ukraine of trying to kill President Vladimir Putin in an alleged attack on his residence in the Kremlin on 3 May.", "Ukraine denies carrying out the attacks.", "BBC Verify has confirmed the location of three reported drone attacks in south-west Moscow on 30 May.", "On 31 May, an oil refinery was set ablaze in Krasnodar Territory in southern Russia, about 200km (124 miles) from the Crimean border. The regional governor said it was probably caused by a drone.", "Another oil refinery in Krasnodar Territory, first struck earlier in May, was hit again by a drone, but no damage was caused according to Russian officials. ", "A suspected drone attack injured at least 10 Russian soldiers at a military training ground in the Voronezh Region on 10 May, according to local media reports. ", "In February, a drone crashed about 100 km (62 miles) from Moscow, in what the local governor said was an attempt to target civilian infrastructure.", "A picture of the wreckage appeared to be consistent with a UJ-22 - a type of drone manufactured by Ukraine.", "It has a range of 800km (497 miles) in autonomous flight. Its range under directly-controlled flight is much shorter.", "In December last year, a drone attack hit an airbase 600km (372 miles) north-east of the Ukrainian border, leaving three people dead, according to the Russian military. ", "According to Russian media reports monitored by the BBC, there have been more than 60 suspected drone attacks this year in Russia and Russian-controlled territory in Ukraine.", "These have mostly been in the Bryansk and Belgorod regions in Russia near the north-eastern border with Ukraine, as well as in Russian-annexed Crimea.", "Oil facilities, airfields and energy infrastructure have all been targeted.  ", "We have identified nine reported drone attacks on oil depots.  One of these was in Sevastopol, a major city in Crimea, which was hit on 29 April, destroying several of its oil tanks.", "Layla Guest, an analyst at Sibylline security consultancy, says: \"Ukrainian forces will highly likely prioritise targeting oil refineries, as well as railway infrastructure and wider Russian logistics, to cause maximum disruption as part of their strategy ahead of the impending counter-offensive.\" ", "Drones have been deployed by both sides in the conflict, with Russia using Iranian-made drones on targets in Ukraine.", "Ukraine says it is rapidly increasing its production of drones as demand grows on the front line.", "In terms of range, experts say drones launched from Ukraine could reach deep into Russian territory, and as far as Moscow, which is about 450km (280 miles) from the border.", "\"Although Ukraine has not confirmed that its armed forces carried out the attacks [on Moscow], I think that the pre-emptive raids we have seen last year prove that Ukraine has the capability to launch long range attacks of that kind from within Ukrainian territory,\" says David Cenciotti, editor of the Aviationist blog. ", "Drone specialist Steve Wright also said it was possible that a drone could hit the Kremlin having been launched from within Ukraine. ", "But he added: \"My guess is that the drone was launched from far closer in than that, as this would avoid it having to run the gauntlet of much of Moscow's defences.\"", "Ukraine's Minister for Digital Transformation Mykhailo Fedorov recently boasted of a Ukrainian drone called the R18 that \"can fly from Kyiv to Moscow and back\".", "But he denied that he was calling for drone strikes on Moscow.", "Mr Cenciotti says: \"Ukraine has made extensive use of several drones, with the Bayraktar TB2 drone emerging as the real star of the air war for Ukraine, inflicting heavy losses on Russian forces, some of those caught on tape and circulated online.\"", "Turkey has sold Bayraktar TB2 armed drones to Ukraine in recent months, while the Turkish manufacturer of the drones has donated some to crowd-funding operations in support of Ukraine.", "Additional reporting by Tural Ahmedzade, Joshua Cheetham, Thomas Spencer, Shayan Sardarizadeh, Paul Brown and Adam Robinson", "Read more about BBC Verify: Explaining the 'how' - the launch of BBC Verify"]}