{"title": "TV fraud gang jailed for illegally streaming Premier League games", "body": ["Five men who illegally streamed Premier League football matches to tens of thousands of people have been jailed. ", "The gang sold cut-price £10-a-month subscriptions, bragging they made money showing games not otherwise available to watch live in the UK because of \"blackout\" broadcasting rules.", "Their operation, described as the biggest so far, received more than £7m from 50,000 subscribers.", "The sentencing follows a rare private prosecution by the Premier League. ", "The fraud prosecution was brought to protect \"some of the world's most valuable content\", the league's lawyers said.", "It followed a lengthy trading-standards investigation led by Hammersmith and Fulham Council.", "And the personal details of many of those who paid for Flawless TV are now in the hands of investigators, raising the question of what action might be taken against them. ", "At Derby Crown Court, the gang's \"prime mover\", Mark Gould, 36, was sentenced to 11 years in prison. ", "Four other members were sentenced to between three and more than five years. ", "One of them, Christopher Felvus, 36, was also found guilty of voyeurism and possessing indecent images of children, discovered on his computer. ", "Trading-standards investigator Doug Love led a raid on Gould's smart riverside flat in Greenwich, south London. ", "\"I don't think any of us realised how big it was,\" Mr Love tells BBC News.  ", "\"When we went into the spare bedroom, there were 20 or 30 set-top boxes linked together.\"", "The gang took feeds from broadcasters in the UK, Qatar, the US, Australia and Canada and streamed them a few seconds later via the Flawless service.", "The operation developed apps offering Premier League matches and other content, which ran on phones and smart TVs. ", "Users picked what they wanted to watch from a fully-functional on-screen programme guide.", "The gang made £7.2m between 2016 and 2021, according to the league. Gould personally made more than £1.7m. ", "Direct subscribers paid £10 a month to watch every Premier League game, compared with about £80 a month for legal services from Sky, BT Sport and Amazon Prime. ", "The case has highlighted a demand for illegal streaming, created by the unavailability of many football matches on TV.", "Uefa allows the Premier League to prevent broadcasts of UK matches between 14:45 and 17:15 on Saturdays. ", "The \"blackout\", in place for decades, is to encourage fans to attend matches, at all levels of football, rather than watch on TV. ", "But Flawless offered subscribers \"3pm kick-off\" Premier League games, otherwise broadcast only abroad. ", "The gang had exchanged messages saying the \"blackout\" was \"good for business\", accounting for 80% of subscribers, prosecutor David Groome told the court.", "Research from the Intellectual Property Office estimates nearly four million people in the UK used an illegal source to watch live sport last year.", "Some pubs and bars also use illegal streams to show unavailable matches, or to avoid the cost of official services, which can be more than £20,000 a year for commercial premises. ", "Fans point out while most games are not televised in the UK, they are all shown live overseas.", "\"The Premier League is on our doorstep and yet we have the least amount of access to that football,\" YouTuber Daniel Bradley, also known as FPL Mate, says.", "\"I would pay more for more - but I don't have that option.\"", "When the investigators raided the homes of gang members, they seized computer equipment and documents detailing the operation of Flawless. ", "As a result, they now have payment information for thousands of those who subscribed to the service. ", "The Premier League pays the Federation Against Copyright Theft to investigate and enforce its copyright over football content. ", "Fact visits those identified as using illegal football streaming, warning them they are potentially breaking the law, as well as issuing \"cease and desist\" letters to those running streams. ", "But it seems highly unlikely fans will face legal action.", "One of the barristers who worked on the Flawless case, Ari Alibhai, said, in an online seminar, in 2021: \"In practice, the idea of someone being prosecuted who isn't also concerned in the trade, so they aren't also concerned in supplying illicit television services, is minimal.\"", "But fans thinking of subscribing to illegal streams could be setting themselves up for another headache. ", "\"You get sports and you are getting a cheap price,\" Mr Love says. \"But you're committing an offence and putting yourself in danger. ", "\"You are contributing to organised crime who won't be paying taxes and can make a quick buck by selling your details on.\"", "These could be used to steal money or hack computers. The streaming sites themselves are also riddled with malware and pornography. ", "Prosecutors in the Flawless case described the lengths to which gangs would go to avoid detection, in a cat-and-mouse game between broadcasters and illegal streamers.", "Sky adds a code on screen during its broadcasts, which acts as a watermark, so it can determine which legitimate accounts are being used for offering illegal streaming. ", "But the Flawless gang developed software to blur the watermark - and so Sky randomised its on-screen position to prevent that.", "Covert \"test purchases\" and subscriptions are also used in the fight against copyright theft, helping the Premier League take down 590,000 streams in 2021. ", "But it remains big business - and when Flawless was shut down, other services were quick to take over, amid complaints from users online. ", "The investigation into the gang continues, with the aim of seizing the illegal money they made. ", "The Premier League's legal team say they will now pursue other illegal streaming operators. ", "\"The Premier League's substantial financial contribution to the entire football pyramid is made possible through the ability to sell our broadcast rights,\" the league's general counsel, Kevin Plumb, said.", "\"We are pleased that through rulings such as this, the courts continue to show that they recognise the importance of safeguarding the Premier League's rights. ", "\"We will continue to protect our rights and our fans by investigating and prosecuting illegal operators at all levels.\""]}