{"title": "Ministers seek to understand more about video games", "body": ["The government wants to find out more about the UK's booming video games industry - including whether its products harm users' mental health.", "Some of the world's best-selling games - including Grand Theft Auto and Football Manager - are made in the UK.", "Over half of British adults play video games and the industry is worth £2.8bn to the UK economy.", "But the government says not enough research has been done on how it can benefit the wider economy.", "It also wants research on how games can be used to improve learning skills and promote \"positive relationships, perceptions and behaviour\" among gamers.", "Researchers have also been asked to look at whether companies are using unethical methods to keep gamers playing.", "Several studies have found that research into the psychological effects of playing video games has been hampered by a lack of data. ", "This lack of evidence was highlighted by a government study on loot boxes - in-game features which allow users to purchase sealed mystery \"boxes\" with real money or points accrued in a game - last year.", "A new guide aims sets out a legal framework that allows the gaming industry to hand over data harvested from video game players while avoiding breaching privacy laws.", "Under the suggested system the gaming industry would use tools, known as Application Programming Interfaces (APIs), to automatically create databases only accessible by researchers. ", "Peter Etchells, Professor of Psychology and Science Communication at Bath Spa University said: \"The new Video Games Research Framework provides a much-needed set of standards to advance the scientific study of games in an ethical, progressive and robust manner. ", "\"My hope is that this will allow us to leverage the power of player data, in order to answer meaningful questions about how games can impact health and behaviour.\"", "The new framework has been developed by the Department for Culture, Media and Sport in collaboration with academics and the games industry.", "The UK is the fifth largest video game market in the world, according to the Entertainment Retailers Association.", "Creative industries minister John Whittingdale said: \"Video games are a booming industry - employing thousands of people and contributing billions to our economy, whilst bringing enjoyment to people in fun and challenging ways.", "\"Today's plans will encourage more research and study in this area so we can better support the opportunities of this highly innovative sector while also protecting players.\"", "British games companies can apply for the Video Games Tax Relief (VGTR). If a company qualifies, it can claim back 20% of production costs during development.", "It is estimated that 68% of games supported by the VGTR would not be made in the UK, or at all, without it."]}