{"title": "Making AI delivery robots disability-friendly and 'cautious pedestrians'", "body": ["The company behind AI robots which deliver shopping to your door has said it \"constantly\" talks to disabled people to ensure safety. ", "The knee-high machines from Starship Technologies can carry three bags across town.", "They use the same pavements as pedestrians and a new panel advises on collision avoidance ", "Now in Wakefield, the team say \"lived experience\" and knowledge of disability is at the heart of its operation.", "They look like freezer coolers on wheels, Lisa Johnson head of public affairs at Starship Technologies says. \"It trundles along on its six little wheels and it can climb up and down the kerbs as well.\"", "But as a robot designed to use pavements, it could have become another frustrating obstacle for disabled people to navigate, such as abandoned bikes, e-scooters and street furniture.", "But Lisa told the BBC's Access All podcast that some safety solutions have already been put in place and the robots had been programmed to be \"cautious pedestrians\". ", "They use obstacle avoidance technology - sensors and a camera - to track what is moving towards it, and how quickly.", "\"Its job is to stay out of your way,\" she adds.", "One of the scenarios the company has focused on is what happens when a wheelchair-user and robot come across each other on a narrow path. ", "A similar problem made headlines in America in 2019 when a student at the University of Pittsburgh tweeted she had been trapped on a road as traffic approached because a Starship Technologies robot was blocking the only accessible entrance to the sidewalk.", "At the time, she told the local radio station, 90.5 WESA: \"It was really bizarre to realize that a non-sentient thing was putting me in danger and making me feel I was helpless. I think I was just laughing at it like, 'Oh cool, this is my life right now'.\"", "The robots were removed for several days. And after reviewing the footage of the incident, the company released a statement saying it disputed the student had been impeded from getting on the sidewalk, but it did update its mapping system.", "Lisa says, since that incident \"we spent a lot of time having the robots learn what mobility devices look like\" and the robots now know to get out of the way. ", "If it can't get out of the way on its own, human back-up will always be nearby to step-in to assist. ", "One mobility aid it currently struggles to recognise is a white cane, used by blind and visually impaired people. ", "\"Canes are really thin,\" Lisa says. \"And the robots don't encounter canes very often. So we've got to make sure we keep having these interactions so the robots can understand what canes are.\"", "After more on-the-job learning, it is hoped the robots will detect a cane and make its presence known with a spoken message: \"Hi, I'm a Starship robot, I'm just letting you know that I'm here.\"", "Steve Tyler, director of assistive technology at the charity, Leonard Cheshire, is one of those who signed up to Starship Technologies' Disability Advisory Panel. He is blind himself.", "\"There are lots of opportunities, [but] there are also lots of threats,\" Steve says of the rapidly-developing technology. \"We need to be involved from the outset as a disability community to ensure that we drive some of what is delivered.\"", "One element Steve is keen to see improved is the arrival of the device at someone's home. Currently, once you lift the lid to retrieve your shopping it plays a song of your choice.", "But how would a blind person know it was there?", "\"You might want a signal before that happens, so you know where it is,\" he advises.", "Although this technology might seem futuristic, Steve says it is essential everyone is involved in the conversation around such technology, as it has the potential to quickly become the norm and impact how we all live in the future.", "\"These technologies not only bring accessibility closer to clients that need it, but it also has an impact on, potentially, how we develop cities and towns, how we lay out pavements, how we lay out shared spaces.\" ", "As for the song it sings as you open its lid to retrieve your shopping, that's also become a contentious issue, according to Lisa.", "\"One of our most popular songs at the moment is Baby Shark. Is that a plus or a minus? I don't know at this point.\"", "You can listen to the podcast and find information and support on the Access All homepage."]}