{"title": "Ukraine war: Russian air strikes target Kyiv for third night running", "body": ["Blasts were heard in Kyiv and several buildings were set ablaze after Russia targeted Ukraine's capital for the third night running.", "Officials say falling debris caused the blazes, as Ukraine's air defences intercepted more than 20 drones. At least one person is reported killed.", "In Moscow, a drone attack later caused minor damage to several buildings, the mayor of the Russian capital said.  ", "Sergei Sobyanin said \"all the city's emergency services\" were at the scene.", "He added that \"so far, no-one has been seriously injured\".", "The attacks on Moscow came after another night of drone strikes on the Ukrainian capital.", "Citing preliminary information, Kyiv's military administration said more than 20 kamikaze drones had been destroyed in the latest attack.", "It said one person was killed and three injured as a fire started in a multi-storey building in the southern Holosiivskyi district, ", "\"Two upper floors are destroyed, and there may be people under the rubble,\" the administration said in a statement.", "Two private buildings were ablaze and several cars damaged in the Darnytskyi district - just across the Dnipro river. ", "Kyiv Mayor Vitaliy Klitschko described the latest attack as \"massive\", urging residents \"not to leave shelters\".", "The air raid alert was lifted after three hours, meaning that the Russian air assault was over for the time being.", "It was the 17th attack on the capital since the beginning of May, including a rare daytime attack on Monday.", "President Volodymyr Zelensky has praised US-made Patriot air defences supplied to Ukraine.", "In his video address late on Monday, he said they ensured \"100% downing of any Russian missiles\".", "\"Russia wants to follow the path of evil to the end, that is, to its defeat, because evil cannot have any other end but defeat. The world must see that terror is losing,\" Mr Zelensky added.", "Meanwhile, Gen Kyrylo Budanov, the head of Ukraine's military intelligence, warned of a swift response to the Russian strikes.", "Russia's military have managed to hit some targets - including an apparent air base - were hit in other regions of Ukraine.", "On Monday, the authorities in the western Khmelnytskyi region said five aircraft had been damaged at a military location. The runway there was now being repaired, the authorities added, without providing any further details.", "Russia's military has said that all intended targets were hit during its recent attacks on Kyiv and other Ukrainian cities.", "The claims by the warring sides have not been independently verified.", "Russia - which launched its full-scale invasion in February 2022 - has been using kamikaze drones as well as a range of cruise and ballistic missiles. ", "Analysts say Moscow is seeking to deplete and damage Ukraine's air defences ahead of its long-expected counter-offensive. ", "Ukraine has been planning a counter-offensive for months. But it has wanted as much time as possible to train troops and to receive military equipment from Western allies."]}