{"title": "The 'exploding' demand for giant heat pumps", "body": ["There are 2.5 million litres of water in an Olympic-sized swimming pool. ", "If for some reason you wanted to bring it from a pleasant 20C to boiling point, German firm MAN Energy Solutions (MAN ES) has a heat pump that could do it. And it would take less time than Kenneth Branagh's film version of Hamlet.", "\"We can do this in less than four hours,\" explains Raymond Decorvet, who works in business development at MAN ES. \"Or we could freeze the whole thing in about 11 hours.\"", "Theirs is among the largest heat pump units in the world. Heat pumps work by compressing gently warmed refrigerants to raise the temperature of these fluids. That heat can then be passed on to homes or industrial machinery.", "Heat pumps require electricity to work but can produce around three or four kilowatt hours of heat for every kilowatt hour of power they consume.", "Heat pumps are increasingly popular with some home owners but domestic devices are relatively small and tend to have outputs of several kilowatts or so. MAN ES's biggest commercial heat pump is thousands of times more powerful - with a total heating capacity of 48 megawatts (MW). ", "It can produce temperatures of up to 150C and heat thousands of homes, not just one. The company recently installed two of these machines in the port city of Esbjerg, in Denmark.", "In this installation, the heat pumps' CO2 refrigerant will absorb a small amount of heat from seawater. Compressors boost the temperature of the CO2 and the system can then transfer this heat, providing water of up to 90C to a district heating system serving 27,000 households.", "\"The demand for district heating is exploding,\" says Mr Decorvet. An urgency to move away from fossil fuels is leading to a rush - particularly in Europe - for bigger and beefier heat pump systems that can power entire towns. But who has the biggest, megawatts-wise?", "It might seem like a relatively straightforward question but it is actually quite tricky to answer definitively. Not least because heat pumps don't tend to work at maximum capacity all the time. In Esbjerg, MAN ES's heat pumps will run at about half their potential output, for instance.", "And trying to compare the world's largest heat pump systems is difficult because, often, they are made up of multiple smaller heat pumps chained together. Take the district heating system in Stockholm, Sweden, often referred to as the largest heat pump set-up in the world.", "This is probably true, it has a maximum capacity of 215MW - but that total is the sum of seven heat pumps, two 40MW and five 27MW devices, a spokesman for energy provider Stockholm Exergi explains.", "Elsewhere in Sweden, Gothenburg has a 160MW heat pump system that consists of four units. Two of them are actually bigger than those in Stockholm, with capacities of 50MW each.", "They have been in operation since 1986 and probably hold the title of the most powerful individual heat pumps currently in use, though they are clearly rivalled by newer devices such as those made by MAN ES. ", "Last year, German chemicals firm BASF and MAN ES announced their intention to build a 120MW heat pump that would, reports suggested, be the world's largest. ", "It would have provided heat for industrial uses at a site in Ludwigshafen. However, it was not to be. \"BASF has decided not to proceed with the project,\" a spokesman told the BBC. The firm is exploring other potential heat sources instead, which it hopes will be more economically attractive.", "Size isn't necessarily everything, notes Dave Pearson, group sustainable development director at Star Refrigeration. Efficiency matters and he argues that ammonia - his firm's choice of refrigerant - helps to make heat pumps particularly efficient. ", "Veronika Wilk at the Austrian Institute of Technology and colleagues have studied the use of heat pumps for industrial applications, to provide heat in pharmaceutical, food or paper factories, for example. ", "So long as they don't require very high temperatures beyond 200C, companies are increasingly turning to heat pumps, Dr Wilk argues, because it allows them to move away from natural gas, which has become extremely expensive following Russia's invasion of Ukraine.", "But industrial heat pumps tend to be merely several MW in capacity or so. You are more likely to spot truly giant heat pumps in a district heating system, such as those mentioned above, says Dr Wilk.", "\"The beauty of district heating is that you can decarbonise a lot of households at once,\" she adds.", "There are many other examples of heat pump-powered district heating systems springing up. In Vienna, a 55MW system using three heat pumps is due to go live this autumn.", "The machines will harvest heat, around 6C, from treated wastewater, explains Linda Kirchberger, division manager asset decarbonisation and new technologies at Wien Energie. ", "The treated water used to go straight into a river. \"Now it does a detour and we take it through the heat pump system,\" she says.", "The system will lift temperatures from 6C to 90C and the heat will go on to supply 56,000 households. In 2027, Wien Energie plans to double the system's capacity with three more heat pumps, reaching 110MW in total.", "While still impressive, and weighing more than 200 tonnes each, these individual units have a capacity of less than 20MW. The manufacturer, Johnson Controls, confirmed to the BBC that its largest heat pumps have a maximum output of 28MW.", "More technology of business:", "A similar system, also using heat from wastewater, is planned in Hamburg, according to reports. It will have a capacity of 60MW, though this too will rely on multiple heat pumps linked together, a spokeswoman for Hamburg Wasser, the water company involved in the project, says.", "But keep an eye on the future. In the Finnish capital Helsinki, a plan is afoot to construct a gargantuan heat pump system with a total capacity of 500MW. ", "This will likely be comprised of multiple units, as in Stockholm, Gothenburg and Esbjerg, but Helen, the energy company behind the scheme, has not yet revealed how it will all come together.", "MAN ES is one firm bidding for the contract. A spokesman declined to explain exactly what configuration of heat pumps would allow the company to provide 500MW of heat. Mr Decorvet says, simply, \"I hope we are going to win.\""]}