{"title": "Ukraine war: Gen Kyrylo Budanov promises revenge after latest Kyiv attack", "body": ["The head of Ukraine's military intelligence has warned of a swift response to a series of Russian missile strikes on Kyiv. ", "Gen Kyrylo Budanov said Monday's attacks failed to intimidate people in the capital who just got on with life. ", "All the missiles were shot down, officials said, and there were no reports of casualties.", "However flaming debris from the intercepted missiles landed in residential areas in central Kyiv.", "Monday's attack followed two nights of heavy drone strikes, the latest in some 16 air attacks on the Ukrainian capital this month.", "The latest was unusual because it came during the day and seemed targeted at the city centre, whereas other strikes on Kyiv in May have been at night and directed at key infrastructure or air defences on the outskirts. ", "Gen Budanov said he wanted to \"upset\" Russia's supporters by letting them know people in Kyiv were undeterred by the attack and had continued working after it. ", "\"All those who tried to intimidate us, dreaming that it would have some effect, you will regret it very soon,\" he added in a statement published by Ukraine's intelligence ministry. \"Our answer will not be long.\"", "According to reports, only one person was injured and all missiles were destroyed by Ukrainian air defences. Russian authorities claimed all their targets had been hit.", "Air raid sirens reportedly also rang out across several other Ukrainian regions. ", "Local military commanders in Kyiv accused Russia of changing its tactics and deliberately targeting the civilian population. It certainly appears that Moscow wants to step up its pressure on Ukraine even further ahead of any counter-offensive.", "Oleksandr Scherba, ambassador-at-large at Ukraine's ministry of foreign affairs, told the BBC that the last few days had been very difficult for Kyiv residents.", "\"Almost every night, the skies look and sound like another Star Wars episode, but we don't feel much of Russian rockets hitting their targets here within the city area.  And this is all thanks to the decent countries, decent people of the world who gave us this air defence,\" he said.", "Living in the capital was anything but normal at the moment, Mr Scherba said, adding that the drone attacks and sleepless nights had become \"part of our routine\". ", "On Sunday, Ukraine's President Volodymyr Zelensky praised his country's air defence forces after Kyiv sustained the largest drone attack since the war began.", "\"You are heroes,\" said Mr Zelensky, after military commanders said most of the drones launched by Russia were brought down.", "In its recent attacks, Russia - which launched its full-scale invasion in February 2022 - has been using kamikaze drones as well as a range of cruise and ballistic missiles. ", "Analysts say Moscow is seeking to deplete and damage Ukraine's air defences ahead of its long-expected counter-offensive. ", "Ukraine has been planning a counter-offensive for months. But it has wanted as much time as possible to train troops and to receive military equipment from Western allies.", "On Monday, in Russian region of Belgorod, the governor said that several frontier settlements were being shelled simultaneously by Ukrainian forces.", "In the meantime, Russian forces have been preparing their defences in the seized regions of south-eastern Ukraine."]}