{"title": "Ely: How social media influenced aftermath of crash deaths", "body": ["A riot which erupted after the deaths of two teenagers showed how police forces struggle to cope with how events were told on social media, experts say.", "Kyrees Sullivan, 16, died alongside his best friend Harvey Evans, 15, in a crash in Ely, Cardiff, on Monday.", "Allegations spread rapidly that a police van had been chasing them and several hours of violence followed.", "Prof Matthew Williams, said while the riot was not caused by social posts, it acted as a catalyst.", "\"In any riot or large-scale disturbance, reasons like deprivation, lack of opportunity and distrust in police might well be cited,\" added Prof Williams, who is chairman in criminology at Cardiff University's School of Social Sciences.", "\"The immediacy of the riot might be a key part of social media's influence.", "\"The pace of it is much more rapid and it can collapse the timeframe where police communication or dialogue with the community can happen.\"", "Nine arrests were made while 15 officers were injured.", "Following the crash which claimed the boys' lives shortly after 18:00 BST on Monday, social media posts spread swiftly. ", "One person wrote: \"The FACT is that they were being chased by the police.\"", "Another said: \"Apparently police were chasing two kids and then they got run over by a bus?\" ", "Violence quickly erupted, with cars set alight and fireworks thrown at police as crowds gathered.", "The following morning, police and crime commissioner (PCC) Alun Michael claimed there was no police chase.", "But then CCTV footage emerged appearing to show a police van following the boys. He later denied he had been misinformed.", "The incident has raised questions about the ability of the police to counter social media rumours.", "Policing and crime commentator Danny Shaw said with an independent investigation under way people should avoid speculation.", "\"Social media can be a real problem for policing in general because claims, whether false or otherwise, can be spread very quickly. ", "\"That can inflame and exacerbate existing tensions and police have to deal with that - particularly if those claims involve the police themselves.", "\"A report, a video, an image can be uploaded and posted around the whole world within minutes. Issues can be amplified in a way that didn't happen before.\"", "Former chief superintendent Gerry Toms began his Cardiff posting the day after riots broke out in the same area back in 1991.", "The Ely bread riots saw a general store run by a Pakistan-born shopkeeper on Wilson Road pelted with bricks and rocks.", "Three nights of unrest followed, with up to 500 people facing off with 175 police officers in riot gear.", "Although he did not police the riots, Mr Toms remembers: \"In those days they had to spread by word of mouth, and that takes time.", "\"Whereas today, social media is exactly that - if I want to make a comment about something I've seen or something I heard, I do it, I press the button. It's instantaneous.\"", "He labelled social media as a \"double-edged sword\", highlighting its benefits to the police.", "\"It's an excellent way for the police themselves to be able to talk to people in a very broad sense in an accurate way,\" he said.", "Mr Toms added that people needed clarity after an incident such has the crash in Ely.", "\"It wasn't clear. If we'd use the word 'followed' - because clearly evidence came out that morning that they had been followed - there is clear evidence that it was a police vehicle behind those youngsters.", "\"So maybe the message that came out from the police early wasn't clear enough to satisfy the people of Ely and, in fact, in the broader public, that the police had perhaps acted improperly in some way.\"", "Mr Toms also questioned the effectiveness of interviews given by officials in the aftermath. ", "\"You've got to be open, direct, frank and quick, and I don't think that happened last week,\" he told BBC Radio Wales Breakfast on Monday.", "He suggested that the chief constable could be sitting with his senior team to review their media strategy over whether they could have handled it better.", "\"But coming out and telling the story is extremely important,\" he said.", "\"You can't hide behind 'oh, well it's a criminal investigation'. ", "\"You have a duty to tell the public what is happening,\" he said.", "On Wednesday, Deputy Chief Constable Rachel Bacon, of South Wales Police held a press conference about the CCTV footage in the moments leading up to the fatal crash.", "She did not answer a question from a BBC reporter about the timeline of events.", "South Wales Police has also said that it \"cannot comment any further\" due to ongoing investigations by the force and the Independent Office for Police Conduct (IOPC).", "Misinformation on social media was not just a problem for the police.", "Cardiff Bus was forced to post its own statement online after suggestions one of its vehicles was involved.", "It said: \"This is not the case. We have already asked newspapers and other media outlets to correct this mistake, but wanted to release this statement so the community knows that none of our vehicles were involved.\""]}