{"title": "Cryptocurrency: Digital artist nets hundreds of thousands in NFT sale", "body": ["A graphic designer has become one of Wales' most commercially successful artists overnight after some of his digital works sold for almost £500,000.", "Ashley Crossland from Cardigan, Ceredigion, designed 7,200 individual works which were bought as non-fungible tokens (NFTs).", "NFTs act as certificates of ownership and are designed to protect copyright.", "\"I never thought it would be this successful,\" he said of the series based on anthropomorphised stags.", "The series was sold for a cryptocurrency called Cardano and each design is unique.", "\"As I've always liked art and technology, I was drawn to the NFT space because it creates the possibility of digital collectability, something that wasn't as easy before. ", "\"I started posting sketches of humanoid deer in communities online and before I knew it the project had gathered a lot of interest and quickly became a massive success.\"", "Since the general sale, which was held over two days at the end of March, some of the individual pieces have been resold for as much as the Cardano equivalent of £6,500.", "NFTs have grown in popularity with digital artists and collectors, but have faced criticism because of the carbon footprint the technology requires.", "In economics, a fungible asset is something with units that can be readily interchanged - like money.", "With money, you can swap a £10 note for two £5 notes and it will have the same value.", "However, if something is non-fungible, this is impossible - it means it has unique properties so it can't be interchanged with something else.", "It could be a house, or a painting such as the Mona Lisa, which is one of a kind. You can take a photo of the painting or buy a print but there will only ever be one original painting.", "NFTs are \"one-of-a-kind\" assets in the digital world that can be bought and sold like any other piece of property, but which have no tangible form of their own.", "The digital tokens can be thought of as certificates of ownership for virtual or physical assets.", "Carol Breen, an artist and lecturer in graphic communication design at Cardiff Metropolitan University, said many in the art world are sceptical about the value of NFTs.", "\"Really all it is is a way of managing ownership in a digital space,\" she said.", "\"I think it gained popularity because a lot of people thought there was a lot of potential to sell art in way that was more democratic, so that it would become available to people who don't have the platform of a gallery.", "\"You can assign a piece of digital certification to a piece of art that's online. That, in some ways, is really good for an artist because you can copyright it as well.", "\"I'm sure a lot of artists have found new audiences through NFTs and a lot of artists that I admire have played around with NFTs, but then a lot of artists that I admire are quite sceptical of them.", "\"Some have said this is just another way that big conglomerates can entice people onto these new types of art markets.", "\"In actuality they are quite closed off to everyday people or everyday artists\".", "As well as the artworks themselves, Mr Crossland and his collaborator, Jameel Sandham, expanded the series to include backstories and a mythical world which their characters inhabit.", "Mr Sandham, the project's writer, said it was exciting to be involved.", "\"I've always loved sword and sorcery and fantasy in general, so I took those ideas and turned them into a full fantasy lore,\" he said.", "\"Ash came up with a lot of the ideas and drew them, and I took those ideas and developed them in the literature.", "\"We have a big team and a massive community and we get a lot of ideas and inspiration from them too.\"", "Mr Crossland said they had ambitions to expand the idea further still.", "\"We have thousands of people who love collecting digital art and reading our stories\", he said.", "\"Building on our success we're going to create interactive web experiences around the art and stories too.", "\"We want to create a fantasy world that millions can enjoy, and we'll do it with literature, art and interactive web.\""]}