{"title": "Money: £9bn in old UK banknotes and coins not cashed in", "body": ["Almost £9bn in old banknotes have not been cashed in across the UK, even though paper £20 and £50 stopped being legal tender in October.", "Paper banknotes have been replaced with plastic notes with a series of security features.", "The Bank of England said the withdrawn banknotes could still be deposited or exchanged.", "There are also £87m of old £1 coins that have not been returned, according to the Royal Mint.", "Details of the cash still in circulation or hiding in homes was revealed in Freedom of Information requests by BBC Wales.", "The Bank of England said 445 million paper banknotes remained in circulation:", "Paper £5 notes were withdrawn in May 2017 and the paper £10 notes in March 2018.", "In addition to the paper cash, the Royal Mint, which is based in Llantristant, Rhondda Cynon Taf, said about 87 million old style £1 coins had not been returned.", "However, about 18 million have been returned over the past year.", "Out of the 1.6 billion that have been returned, about 1.8 million were counterfeit.", "The round £1 coin was replaced by the 12-sided version in October 2017 - the old style coin can still be deposited at the Post Office but cannot be spent.", "According to the Royal Mint, owned by the UK Treasury, about 138 million round £1 coins have been melted down to make some of the new ones.", "The polymer £50 note featuring the portrait of Alan Turing entered circulation on 23 June 2021, meaning the Bank of England's entire collection of currently-printed banknotes is made of plastic.", "While the paper notes are no longer legal tender, a Bank of England spokeswoman said \"all genuine\" banknotes that have been withdrawn from circulation retain their face value.", "They can be returned to banks and some Post Offices, but the latter will only exchange a maximum of £300.", "People can also post old notes to the bank in Threadneedle Street in the City of London, to be paid into a bank account, by cheque or, \"if you live in the UK and your exchange is worth up to £300\", swapped for new-style polymer ones.", "Old notes can also be taken there in person but the bank warns of \"long waiting times\".", "The use of cash fell sharply during the coronavirus pandemic as lockdowns reduced options for spending, this accelerated a downward trend for the use of notes and coins.", "However, cash still accounted for 15% of all payments in 2022, according to the latest available figures by banking trade body UK Finance, making it the second most-popular way to pay after debit cards."]}