{"title": "Ukraine war: Kyiv hit by new massive Russian drone attack", "body": ["Russia has carried out a new massive drone attack on Ukraine's capital Kyiv.", "Kyiv's mayor Vitaliy Klitschko said a man died when drone wreckage fell near a petrol station. A woman was injured.", "Overall, Russia launched a record 54 so-called kamikaze drones on Ukrainian targets, 52 of which were shot down, Ukraine's Air Force reported.", "Russia - which launched its full-scale invasion in February 2022 - has stepped up its attacks on Kyiv, seeking to overwhelm the capital's defences.", "At least two high-rise buildings in different districts of the capital caught fire after being hit by falling drone fragments.", "Kyiv officials also reported that warehouses in the southern Holosiyivsky district had been set ablaze.", "More than 40 drones were downed over the capital overnight, Ukrainian officials said. This information has not been independently verified.", "But President Volodymyr Zelensky praised the air defence and rescue services, saying: \"You look up to destroy enemy missiles, aircraft, helicopters, and drones. Every time you shoot down enemy drones and missiles, lives are saved... you are heroes!\" ", "Kyiv resident Anastasiia said that she was asleep at home when she was woken up by the sound of a drone flying \"very close\" to her window.", "\"I then saw a big flash of light inside the flat. At first it was yellow, then bright orange and then blinding white. It was so bright that I could not see anything in the flat,\" she told the BBC, adding that it all went \"very quiet\" during the flashes and that the sound of the explosions came \"two or three seconds after the flash. It was very loud, like thunder.\"", "\"Those two or three seconds felt like a very long time,\" she said. \"The bright light was transformed into total darkness. I wanted to check if there was any damage. I could not understand what happened. I was in shock so I did not feel scared. I could not understand if I and my flat were OK.\"", "Anastasiia said she only realised she was still alive when she heard the sound of car alarms in the street. \"When people read the news about drones being intercepted, this is what it means in reality. Then I went back to sleep until my friend brought me breakfast and I realised that we have to appreciate every moment of life.\"", "Some officials accused Russia of targeting Kyiv deliberately as residents prepared to celebrate Kyiv Day - the anniversary of the city's foundation more than 1,500 years ago and a popular holiday before the war.", "Earlier on Sunday, air raid alerts were activated in 12 regions of Ukraine, from Volyn in the north-west to Dnipropetrovsk in the south-east. There were also reports of explosions in the city of Zhytomyr, west of Kyiv.", "In its recent attacks, Russia has been using so-called kamikaze drones as well as a range of cruise and ballistic missiles. ", "The frequency of the Russian attacks on Kyiv and elsewhere has been increasing as Ukraine steps up its preparations for a counter-offensive. ", "On Saturday, one of Ukraine's most senior security officials told the BBC the country was ready to launch such an operation.", "Oleksiy Danilov, secretary of the powerful National Security and Defence Council of Ukraine, said an assault to retake territory from President Vladimir Putin's occupying forces could begin \"tomorrow, the day after tomorrow or in a week\".", "Ukraine has been planning a counter-offensive for months. But it has wanted as much time as possible to train troops and to receive military equipment from Western allies.", "In the meantime, Russian forces have been preparing their defences in the seized regions of south-eastern Ukraine.", "Drone attacks by both sides have been rising. Russia has been targeting not just Ukraine's critical national infrastructure but also military targets. ", "In particular, Russia seems to be trying not only to deplete Ukraine's stock of air defence missiles but also to damage the launch systems themselves. ", "In turn, Ukraine has been targeting key locations in parts of the country occupied by Russian forces. Those include command and control sites, logistical supply lines including oil storage centres. Ahead of Ukraine's much expected counter-offensive, the tempo of military exchanges between both sides appears to be rising. ", "In recent weeks, Russia has blamed Kyiv for heavy artillery and mortar shelling on the region of Belgorod. On Sunday, Belgorod's governor ordered all schools along the border with Ukraine and in Belgorod city to close for the summer with immediate effect. ", "Speaking to the BBC, Andrei Kelin, Russia's ambassador to the UK, said his country had \"enormous resources\" and it was yet to \"act very seriously\". ", "Warning that supplies of weapons to Ukraine risk escalating the war to levels not seen so far, he added: \"Sooner or later, of course, this escalation may get a new dimension which we do not need and we do not want.\""]}