{"title": "TikTok creator's warning over sunbed tanning videos", "body": ["There has been a massive increase in TikTok videos promoting the use of sunbeds and tanning products such as nasal sprays, a Belfast content creator has warned.", "Shannon Mitchell, 27, has advised her 150,000 followers not to use such products after her own bad experiences.", "She said she has used sunbeds and nasal sprays in the past but gave them up over the potential harm they caused.", "TikTok is popular with lifestyle influencers and content creators.", "A search on the platform for \"sunbeds\" reveals thousands of results.", "UV radiation from sunbeds is widely acknowledged to damage the skin, with no safe limit for exposure according to the European Commission.", "People who have used a sunbed even once at any stage of their life have a 20% higher risk of developing melanoma skin cancer than people who have never used a sunbed, Dr Louise Herron from the Public Health Agency (PHA) told BBC News NI.", "This risk is increased significantly when you use one before the age of 35, she added.", "Ms Mitchell said she started using sunbeds four years ago and continued on and off until she stopped in July 2022 - she experienced side effects including skin ageing and an increased number of moles.", "\"There were stages where if I was going on a big night out or if I was going on holiday, I would have went every other day on sunbeds and not thought twice about it,\" she said.", "\"I can't even judge other people for doing them because I was being told the dangers of them.", "\"My back is covered in moles. I've had them checked to thankfully they're all fine. ", "\"But if anything does happen in the future with that I've only myself to blame because I was the one that went on sunbeds.\"", "Ms Mitchell also said she regretted using nasal sprays, which are often promoted along with products such as tanning injections.", "Both contain melanotan, a synthetic hormone designed to stimulate cells to produce more melanin - the pigment that darkens skin.", "It is not illegal to use or promote these tanning products but it is illegal to sell them in the UK.", "\"I think promoting it (on social media) is very, very wrong because people are so easily influenced by what they see online, myself included,\" Ms Mitchell said.", "She believes social media platforms should be stricter when it comes to monitoring posts advertising these products.", "TikTok told BBC News NI that any content on its platform that violates its community guidelines will be removed or banned and that it also makes it easy for users to report problematic content for review. ", "Ms Mitchell said she was fully aware of the risks of using sunbeds - she partly blames the pressures of social media to have a glowing tan, as well as recommendations from friends, for encouraging her to use them.", "Dr Herron at the PHA said: \"Many people think having a tan makes them look more attractive but we know having a tan is actually a sign that our skin has been damaged by overexposure to UV radiation.\" ", "According to the charity Cancer Focus NI, short periods of intense UV exposure on sunbeds can speed up skin damage and skin ageing. They can also irritate your skin, causing redness, itchiness and dryness, as well as damaging your eyes. ", "Ms Mitchell said her skin aged very quickly and its texture completely changed soon after starting to use sunbeds.", "As well as these risks, Dr Herron said exposure to UV radiation from sunbeds or the sun is the leading cause of skin cancer. ", "\"Skin cancer is the most common cancer in Northern Ireland and accounts for over 31% of all cancers diagnosed. More than 4,000 people develop skin cancer each year and almost one in 10 of these are malignant melanoma, the most serious form,\" she said.", "\"Malignant melanoma rates have risen over the past 30 years from an average of 103 cases per year in the mid-1980s, to 382 cases in recent years.\"", "It is illegal for people under the age of 18 to use sunbeds in every part of the UK. ", "Laws regulating sunbeds came into force in Scotland in 2009, in 2011 in England and Wales and in 2012 in Northern Ireland. ", "Sunbed regulations were signed into law in 2014 in the Republic of Ireland.", "Ms Mitchell urged those considering starting sunbeds to \"really, really think about your future\".", "\"Think about the people that are having to go and spend hours on end at doctors and hospital appointments to get moles removed, people getting cancer treatment because of sunbeds,\" she said.", "\"Realistically, spending 10 minutes in your evening putting a bit of fake tan on really isn't a big deal.\"", "Dr Herron from the PHA said: \"If you are concerned about skin cancer, for example a mole that has changed in shape, size or colour, you should talk to your GP. ", "\"Early detection of skin cancer can significantly improve survival so regularly checking your skin is important,\" she said."]}