{"title": "Xbox v PlayStation: The battle for control", "body": ["We're halfway through 2023, and there have been some big moves in gaming.", "Sony unveiled its latest PlayStation 5 line-up this week, to mixed reaction.", "And Microsoft launched its attempt to reverse a ban on its Activision-Blizzard takeover.", "So far, it's not been a great year for Xbox.", "First, that massive merger with the Call of Duty maker was blocked in the UK. ", "Then Redfall, its first big exclusive title in ages, was described as a \"disappointment\". ", "And it wasn't just fans saying that - it's the word Xbox's big boss Phil Spencer used. ", "In an interview, he said Microsoft was now \"third place\" in the console race with PlayStation and Nintendo's Switch.", "And he didn't think \"great games\" alone would change that.", "Ouch.", "But it's not always been like this. ", "Here's a short history of a console war, and Microsoft and Sony's efforts to become the games industry's big boss.", "It's 1999.", "Sony's getting ready to announce the PlayStation 2 (PS2) - the powerful update to its game-changing PlayStation.", "Rivals Sega and Nintendo, who've struggled to fend off the new competitor, watch nervously.", "But someone else is keeping a close eye on the developments - Microsoft.", "It's got a healthy presence in the PC gaming market, but decides it can't ignore the massive popularity of home consoles.", "When it reveals Xbox to the world gamers are sceptical. It's written off as a \"PC in a box\". And it's the first time an American company has made a console since the disastrous Atari Jaguar.", "People don't fancy its chances.", "But it makes a respectable impression. Sales are decent, it boasts quality games like Halo and there's one area where it outperforms the competition - online multiplayer.", "Microsoft will make a loss on the console, and it won't come close to matching sales of the PS2 - still the most successful console in history.", "But it lays the groundwork for the next generation, where things start to get interesting.", "In 2005, Microsoft gets a head-start on Sony by releasing the Xbox 360 a full year before its rival can get the PlayStation 3 (PS3) out of its factories.", "It's not the smoothest launch - gamers struggle to actually get their hands on one at first.", "And early machines suffer from the \"red ring of death\" failure, sending Microsoft's warranty hotline into meltdown.", "But its strong online support, particularly the Xbox Live multiplayer service, and exclusives like Gears of War, Halo 3 and Bioshock will turn a lot of gamers' heads.", "When Sony's PS3 eventually arrives, it's expensive and many think the launch line-up is underwhelming. ", "It takes developers a long time to exploit the machine's hardware, and this time Sony are the ones playing catch-up.", "They end the generation strong - 2013's The Last of Us is considered a masterpiece - and there are other solid exclusives along the way.", "According to sales estimates, both the 360 and PS3 sell upwards of 80 million units by the end of their lifespans.", "In the background, Nintendo's motion-controlled Wii has been a sensation, outselling both machines, but is seen as less of a \"serious\" gaming device by many.", "Most experts agree that Microsoft's offering makes the biggest impact on future console gaming.", "So it's probably feeling pretty confident as it prepares to launch its next machine.", "By 2013 companies have a new foe to contend with - instant feedback from social media.", "When Microsoft announces the Xbox One it spends a lot of time talking about its multimedia features.", "They're impressive, but fans want to hear about its gaming abilities.", "When those are revealed, Microsoft also outlines plans for a complicated digital licensing system that ties copies of games to a user's Xbox Live ID.", "People worry it wants to kill the second-hand market and the ability to lend games to friends and family.", "The internet isn't happy, and it doesn't hold back.", "Sony even gets in on the backlash, capitalising on its rival's confusing new software rules with a mic-drop moment.", "It releases a tongue-in-cheek \"instructional video\", demonstrating how players can lend out their PS4 games.", "The 22-second clip, now widely seen as a legendary slapdown, shows PlayStation CEO Shuhei Yoshida simply handing Sony exec Adam Boyes a copy of Killzone Shadow Fall. ", "And that's it. ", "In the face of criticism Microsoft eventually abandons its licensing plan.", "But, with the first PR battle won by Sony, the next generation already looks difficult.", "And so it proves to be. ", "The Playstation 4 (PS4) is $100 cheaper on its US release, and tends to outperform its rival graphically on multiplatform titles.", "And then there's the games. Xbox struggles to match Sony's impressive exclusive catalogue, which will boast God of War, Uncharted 4 and Horizon: Zero Dawn by the end of its life cycle.", "Microsoft gains some credit when it launches Game Pass - its Netflix-style subscription service giving access to a vast range of old and new titles.", "But it's not enough to level the playing field. Sony says it's shipped 117 million PS4s by May 2022, while estimates put Xbox One's figure at about 58 million.", "And don't forget Nintendo. Its hybrid Switch console has been a smash hit, shipping at least 125 million units. ", "On its 2021 release, the PlayStation 5 (PS5) has a huge response straight from the start.", "Sony says it's the biggest launch in its history, and it struggles to keep up with demand amid a global shortage of microchips.", "Microsoft's Xbox Series X/S update is also in short supply, but demand does not match its rival, according to reports.", "But the US company isn't giving up. ", "It buys Zenimax - owner of respected studios Arkane, Bethesda and id Software - putting Microsoft in charge of beloved series like Fallout and Doom.", "When it offers to buy Activision Blizzard for $69bn, it's seen as a merger that could radically change the industry.", "That hits a problem when UK regulators block it, potentially killing the deal worldwide. Microsoft appeals the decision.", "Meanwhile, the PlayStation 5 continues to dominate the next-gen console scene.", "But, two and a half years since launch, it still lacks the depth of truly exclusive games that have been seen as system-sellers for previous generations.", "As for Xbox, if you take Phil Spencer's words at face-value, it's not interested in \"out-consoling Nintendo or Sony\".", "And there's certainly an expectation that Microsoft could shift its focus towards subscriptions and cloud gaming.", "But, with its 2023 showcase yet to take place, the latest battle between Xbox and PlayStation isn't over yet. ", "Follow Newsbeat on Twitter and YouTube.", "Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here."]}