{"title": "Esports: Fifa pro says degree course will level up industry", "body": ["Turning up to college and playing games all day might sound like a dream.", "But gamers on a new degree-level esports course in \"UK gaming capital\" Dundee say it's about more than just pressing the right buttons. ", "The competitive gaming industry is big business - estimates say it could be worth $1.9bn by 2025.", "Dundee and Angus college, where the course will be held, is also involved in plans for a new 4,000-seater esports arena in the city. ", "But it wants to prepare students for what goes on behind-the-scenes.", "Studies have suggested its top players can face similar pressures as athletes in other professional sports.", "But some, like Adam Ryan, say that the road to the top is rocky, and you're not always well-prepared.", "\"There's been some dark moments,\" says Adam, a pro Fifa player and lecturer at the college.", "\"It's a passion for me to share what I've learned, so people don't need to go through it the same way,\" he tells BBC Newsbeat. ", "Adam, 22, played for Rangers in this week's inaugural eScottish Cup competition.   ", "He says he's living his dream as a professional gamer. ", "Full-time esports athletes can earn seven-figure sums through playing high-profile tournaments and lucrative sponsorship deals.", "\"The opportunities are endless in esports and it's only growing,\" says Adam.", "But people don't always talk about what it takes to get there, and the potential toll.", "\"I learnt the hard way,\" says Adam. \"I had to make all the mistakes myself, because there was no education.\" ", "There's concern around the support network for pro-gamers, particularly around their wellbeing.", "\"I've had my own fair share of mental health struggles, doing the stereotypical esports stuff,\" says Adam.", "\"Staying up very late, drinking energy drinks, not looking after yourself - I don't want other people to go through that.\"  ", "Students at the college agree health and wellbeing support is \"extremely\" important. ", "\"I used to be terrible for staying up all night,\" admits Dylan Matthews, 19. ", "\"Playing early morning, not eating, it's not a good habit.\"", "Declan Hay, 18, points out that gaming can also help with mental health.", "\"Gaming just keeps my mind off stuff, it clears my head,\" he says.", "And they're both relishing the prospect of turning their passions into a profession in Dundee.", "The city's famously where Grand Theft Auto was created, and it's been at the forefront of UK games development ever since.", "\"I always grew up playing games, I loved doing it, and now it's easier to make a career out of it,\" says Michael Bachelor, 23. ", "But if you simply fancy playing all day, the new course - which launches later this year - might not be for you. ", "\"It's about the industry as a whole,\" says Laura Louch, who leads esports education at the college. ", "\"It's looking at digital marketing, event management, wellbeing, coaching.\" ", "She adds that students will be \"encouraged to use the gym and swimming pool\", while a mental health team will \"help the students deal with any online hate\".   ", "\"Not everybody's going to be a player,\" admits Adam, but \"there are hundreds of jobs in esports.\" ", "So Adam's advice is to \"try everything\" in the industry. ", "\"Are you building your network? Are you streaming? Are you commentating? Are you wanting to get into marketing or social media management?\" ", "We might be talking about video games on computer screens, but Adam says you need to be an \"open book\" to make it in esports. ", "Follow Newsbeat on Twitter and YouTube.", "Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here."]}