{"title": "Nurse's stolen mini recovered in Leicestershire after Twitter appeal", "body": ["A social media campaign has helped to track down a stolen classic Mini Clubman belonging to an NHS nurse.", "Alice's much-loved car was taken on Saturday night whilst she and her husband Paul were visiting friends.", "The couple, who live in Somerset, sought help from motoring journalist Paul Woodford to locate the car affectionally know as Eileen.", "His Twitter post was shared thousands of times before the car was eventually found by police in Leicestershire. ", "Mr Woodford told BBC Radio Leicester why he got involved.", "\"This was something her and her husband bought themselves and they've thrown their energy into after a tough couple of years as you can imagine - working on the front line in the Covid pandemic.", "\"And it has become a part of the family, it means something really special to them,\" he said.", "Among the thousands of people to share the appeal were musician Midge Ure and the former Top Gear presenter Quentin Willson.", "Over the following days Mr Woodford received numerous reports of sightings.", "He said: \"We were getting messages from all over the place.", "\"One of the messages said 'Is this the car? and it was a picture of a car half covered on the back of a trailer.\"", "Police were called and the car, later confirmed as Alice's Mini, was eventually recovered in Kirk Lane, Enderby.", "A Leicestershire Police spokesperson said: \"Just after 11:00 BST on Thursday, Leicestershire Police were made aware that a Mini Clubman - stolen earlier this week - had been spotted on the back of a flatbed truck.", "\"Officers attended the location and recovered the vehicle.\"", "The force said no arrests had been made and that enquiries into the theft were continuing.", "Paul, 41, said his wife had not yet been reunited with her car but she was \"absolutely over the moon\" it had been found.", "\"We never expected to get it back,\" he said.", "He believed that it was only found as a result of the social media appeal.", "Follow BBC East Midlands on Facebook, Twitter, or Instagram. Send your story ideas to eastmidsnews@bbc.co.uk."]}