{"title": "TikTok: Essex dad wants access to late daughter's activity", "body": ["A father is hoping to gain access to his daughter's social media activity to try to piece together why she died.", "Maia Walsh, 13, was found dead at her Hertfordshire home on 7 October, a few weeks before her birthday.", "Her dad, Liam Walsh from Basildon, said she was watching self-harm TikTok videos before her death and had previously mentioned a social media game.", "TikTok said it would \"continue to prioritise protecting\" its community.", "Liam said he would like the coroner's court to send an application to TikTok asking the social media giant to provide details of Maia's activity on its app.", "\"I'd like to know what it is that has taken her life. I would like to know why her life has been taken, what has contributed to this,\" he told BBC Essex.", "Maia was an \"enlightening little girl\" who had the ability of walking into a room and have everyone \"roaring with laughter\", said Mr Walsh.", "He said last summer she had mentioned a social media game she had seen.", "\"If anything happened to you, you would destroy me because you are my life,\" Liam said he told Maia after advising her to \"be careful\".", "If you're affected by any of the issues in this article you can find details of organisations who can help via the BBC Action Line.", "In the early hours of a Friday morning in October, Mr Walsh said he received a phone call from Maia's mother screaming \"Maia has died\" at their home in Hertford.", "\"That was the beginning of the nightmare,\" he added.", "He said emergency staff at the hospital greeted him and were \"staring at the floor when I walked in, as they knew what I was walking into\".", "\"The blood drained from my face. I was ashen, grey, I looked like I was about to die, and I think a large part of me did die that day,\" he said.", "Mr Walsh said when he got her phone and tablet back from the police and unlocked them, he and Maia's mother found two self-harm videos their daughter had liked on TikTok.", "An inquest into Maia's death was due to take place at the end of May, but it has been delayed because of her father's complaints about hers social media activity not being harvested.", "\"If it takes 10 years or 15 years for the truth to emerge, so be it,\" said Mr Walsh.", "\"I will not accept anything less than the truth in relation to my child.", "\"It's the least I deserve; it's the least my family deserve; it's the least Maia deserves.\"", "Former police detective John Staines, who now runs eSafety Training which gives talks in Essex schools, said \"we definitely need to hold tech companies to account\", but educating parents was also important.", "\"It's about talking to our children and getting to understand their world,\" he added.", "Mr Staines said the \"power of influence\" on social media was \"immense\" but \"you can't stop\" children seeing dangerous content online.", "Parents should encourage their children to talk to them about what they see on social media, he said.", "A TikTok spokesperson said: \"Our deepest sympathies are with the family experiencing this tragic loss. ", "\"The safety of our community is our priority and we do not allow content that promotes or glorifies suicide or self-harm on our platform.", "\"We will continue to prioritise protecting and supporting our community, working with expert partners and providing safety resources to those who need them.\"", "A Hertfordshire Police spokesperson said that investigating officers' \"thoughts are with Maia's family and friends at this very difficult time\".", "\"It would not be appropriate for us to comment further until the inquest hearing has concluded and all evidence has been presented,\" they added.", "If you have been affected by any issues raised in this article, help and support can be found at BBC Action Line.", "Follow East of England news on Facebook, Instagram and Twitter. Got a story? Email eastofenglandnews@bbc.co.uk or WhatsApp us on 0800 169 1830"]}