{"title": "Venezuela: 'I'm paid to tweet state propaganda'", "body": ["Rafael - not his real name - is a massive internet nerd. At 59 years old, he is active on all the main social media platforms, dabbles in cryptocurrencies and even calls himself an influencer. ", "But that is not all he does online.", "Rafael is also part of a group of Venezuelans being paid by the state to tweet propaganda. ", "He spends at least 30 minutes a day posting pro-government content. \"The aim is to amplify the information the government puts on Twitter,\" he explains. ", "Every day, Venezuela's ministry of communications tweets a \"hashtag of the day\", which is repeated not only by elected officials' accounts and state sympathisers but also by \"digital troops\" like Rafael, who are paid to share propaganda. \"You have to space it out to avoid being blocked. I do about 100 in the morning and 100 more in the afternoon,\" he says.  ", "\"The idea is to maintain a collective narrative. The fight against the enemy [the West] still exists,\" explains Prof Félix Seijas from the Central University of Venezuela. ", "This narrative predates social media and is typical of the left-wing Chavismo ideology, which became popular under Hugo Chávez, the mentor and predecessor of current president, Nicolás Maduro.  ", "In 2018, Rafael found a tweet with a hashtag that made no sense to him. \"I asked the person [who had written the tweet] what it was about and he told me about the rewards.\" ", "BBC Trending has seen a few private groups operating on Facebook and Telegram, with between 700 and 3,000 members, which share the latest hashtag to encourage each other to tweet.", "Not all participants join groups like this, but Rafael plays an active part in one of them.", "Despite frequently sharing content in support of the government, he does not support it, because of the arbitrary arrests, expropriations, insufficient wages and Mr Maduro's \"lack of charisma\".", "He says he only tweets for the paid incentives, but complains that they are too low. ", "As a security guard for a private company, Rafael earns the equivalent of $80 (£65) a month. With the additional $10 he makes a month from tweeting, he can buy small amounts of flour, oil, rice, or even airtime for his mobile phone. ", "On the surface, the information he amplifies seems harmless but Venezuelan disinformation experts and political analysts see it as part of a wider strategy to suppress free speech. ", "Adrián González, founder of Cazadores de Fake News, a website debunking Venezuelan disinformation, says the government is using propaganda \"to neutralise information they cannot control\" in an attempt to influence public perception online.", "One way it can do this is by drowning out the noise of its critics, particularly on Twitter. ", "Marivi Vazquez, from ProBox, an NGO combating online disinformation in Latin America, says the purpose of using \"digital troops\" like Rafael is to disrupt the \"trending\" algorithm by polluting it with pro-government messaging.  ", "\"This is very dangerous because when you see what is trending and you see that most of the hashtags are supposedly supporting the government, it's hard to know what's actually happening in the country.\"", "These hashtags are often part of wider campaigns to spread propaganda online.", "When earlier this year, the Venezuelan government was accused of using videos created using artificial intelligence to spread propaganda online, it responded swiftly.", "On Twitter, the Ministry of Communications said the hashtag of the day was #SomosInteligenciaSocial or WeAreSocialIntelligence. ", "The purpose was to counter the allegations that supporters of Chavismo were behind the deepfake videos, which were also broadcast on state TV. ", "Rafael says he does not amplify misleading ideas and cannot remember tweeting the \"social intelligence\" hashtag. He cannot check because his main account, which had more than 14,000 followers, was removed by Twitter, because, he admits, he was not following its guidelines.", "Nevertheless, we know the hashtag took off. ", "According to analysis by Probox, #SomosInteligenciaSocial was used more than 360,000 times over 24 hours and trended on Twitter in Venezuela. Its analysis also found that 90% of the interactions with the hashtag came from accounts deemed to be bots or \"digital troops\" paid to amplify the government's propaganda.  ", "Rafael sent us proof of the payments he received in return for tweeting propaganda. They were screenshots of transfers made into Sistema Patria, a social security app created by the government which gives Venezuelans access to subsidies, and allows them to receive public salaries and state pensions, among other things. From March to April, his statements showed he made the equivalent of nearly $10. ", "According to experts at ProBox who have studied payments through the app, paid propagandists give the Sistema Patria app access to their data so that it can be monitored. Depending on their Twitter activity, \"digital troops\" receive a monthly bonus in their digital wallet. ", "BBC Trending asked the Venezuelan government why it was paying its citizens to tweet propaganda. We also asked whether it was actively using deepfake technology to spread propaganda, but it did not respond. ", "Although it is unclear whether the government played any role in creating the deepfake news reports, it is clear it campaigned to drown out criticism, which may have involved paid propagandists.", "\"It's a paradox,\" explains Mr González. \"Many people do this because they need to eat, they need money for the internet or because they don't have good access to public services.\"", "We tried to speak to more paid propagandists, but some were too ashamed to talk and others feared for their safety. ", "Rafael's candour was an exception.  ", "Listen to Venezuela's \"social intelligence\", deepfakes and propaganda on BBC Sounds."]}