{"title": "PlayStation Showcase 2023: Spider-Man 2 impresses, Project Q confuses", "body": ["Sony's given fans a glimpse of some big upcoming games at its first PlayStation Showcase in well over a year.", "The livestream is usually reserved for the console-maker's most important, crowd-pleasing releases.", "Hype going into the event was huge. Big predictions were made - a Bloodborne remake, The Last of Us: Part 3 and a Twisted Metal update among them.", "Spoiler: None of these turned out to be true. And the general reaction seemed to be \"underwhelmed\".", "There was a lack of genuine first-party exclusives, and many of the PlayStation 5 games on display were already known about.", "But there were some highlights, as well as the odd \"huh\" moment.", "Save the best until last? Sony seemed to think so - it capped the presentation with 12 minutes of gameplay footage from its sequel to the 2018 PS4 hit.", "We saw control switch between Peter Parker in a dark Venom suit - boasting new symbiote powers - and Miles Morales, who got his own PS5 launch game.", "The pair were seen swinging through New York in pursuit of Dr Curt Connors, aka the Lizard, while trying to avoid supervillain Kraven's henchmen.", "Fans generally seemed impressed, excited by the ability to play as both characters and the promise of a darker story turn thanks to the new black suit.", "But the game's existence was already confirmed, and fans had been hoping for news of something new from a Sony studio.", "Probably the worst-kept secret of the night - rumours had been swirling that a remake of PlayStation 2 classic Metal Gear Solid 3 was on the cards.", "And when the brief trailer ended with a glimpse of hero Solid Snake it was finally confirmed.", "The game, which will also be on Microsoft's Xbox Series X/S consoles, doesn't have a release date yet.", "Sony also announced that the first three Metal Gear Solid games will be released as the Master Collection: Volume 1, later this year.", "There was no mention of a Metal Gear Solid 4 re-master - long-wished for by fans, but some suggested it might feature in a volume two.", "Some were concerned that series creator Hideo Kojima, who left developer Konami on bad terms, won't be involved in the re-releases.", "Another confirmed rumour - and the source of most memes - was Sony's new handheld device.", "Imagine a DualSense controller cut in half with an 8in LCD screen sandwiched between, and you've got Project Q.", "Sony promised more details in future, but said it would be capable of streaming PS5 games from your console. ", "You can already do this via a phone or tablet and third-party controller attachment, so lots were left wondering what's special about it.", "And because of its resemblance to Nintendo's Switch and its less-successful Wii U, the \"PS U\" and \"Playstation Switch\" jokes came thick and fast.", "Having said that, some people said they might be interested in picking one up if the price - yet to be confirmed - was right.", "Alan Wake 2, Phantom Blade Zero, and another Final Fantasy 16 trailer got people excited. Although the longed-for FF16 demo didn't appear as hoped.", "And the first look at Dragon's Dogma 2 was a welcome surprise, as it showed work on the sequel to the 2013 sleeper hit was well under way.", "Fans of indie games were well-served, with follow-ups to Journey and Night in the Woods on show, as well as Devolver Digital's The Plucky Squire.", "Resident Evil 4 Remake and Synapse on PSVR2 - as well as a free Beat Saber upgrade that launched as the showcase went out - were also well-received.", "One of the biggest complaints was the lack of true exclusive titles on display.", "Halo developer Bungie, recently bought by Sony, announced it was reviving its 1994 franchise Marathon. But the game will appear on other platforms.", "And the phrase \"Not actual gameplay footage\" earned its money on the night.", "Many of the titles featured in the showcase - FairGame$, from Haven Studio, and Firewalk Studios' Concord - showed \"cinematic\" trailers but no gameplay.", "And taking up a chunk of the stream with a clip from the upcoming Gran Turismo movie didn't go down especially well.", "The summer is usually the time for big gaming announcements, and there are still chances for companies to reveal big new projects.", "US journalist Geoff Keighley's Summer Games Fest kicks off on 8 June, and has promised \"three or four\" big reveals.", "Microsoft will have its own Xbox showcase on 11 June, and Nintendo usually lays on one of its Direct streams before autumn.", "So don't expect those rumours to go away just yet.", "Follow Newsbeat on Twitter and YouTube.", "Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here."]}