{"title": "Microsoft: Chinese hackers hit key US bases on Guam", "body": ["Chinese hackers used \"stealthy\" malware to attack critical infrastructure on American military bases in Guam, say Microsoft and Western spy agencies.", "Experts say it's one of the largest known cyber espionage campaigns against the US.", "A key US military outpost, Guam's ports and air bases would be crucial to any Western response to a conflict in Asia.", "Beijing has called the Microsoft report \"highly unprofessional\" and \"disinformation\".", "Together with the Five Eyes alliance - comprising the intelligence agencies of the US, Australia, Britain, New Zealand and Canada - Microsoft published details of the malware on Wednesday. ", "The Five Eyes initiative is a decades-old intelligence sharing agreement. The partners say they aim to educate critical infrastructure providers and corporate users on how to detect and remove the malware.", "Microsoft, which flagged the breach, says the malicious code was installed to spy on and disrupt \"communications infrastructure between the US and Asia during future crises\".", "It targeted, among others, communications, manufacturing, utility and transportation sectors. The purpose was to maintain access to critical systems for as long as possible.  ", "The attack was carried out by China's state-sponsored cyber group \"Volt Typhoon\" and relied on \"living-off-the-land techniques\", said the tech company.", "This involves hackers infiltrating local networks to modify their tools and issue commands, while remaining largely undetected. ", "Responding to queries at a Chinese foreign ministry press briefing, spokeswoman Mao Ning called the US the \"hacker empire\" and dismissed the report as having a \"serious lack of evidence chain\".", "While the US and China regularly accuse each other of spying, the joint Five Eyes statement is notable, experts say. ", "\"The fact that it's a Five Eyes initiative - there's significant concern over what this attack might be a precursor to in terms of the intent behind it, and the sabotage element here,\" said Jamie Norton, a partner at restructuring and advisory firm McGrathNicol.", "Mr Norton, a former information security advisor to the Australian government, noted that Microsoft's analysis of the attack found no evidence that the Chinese hackers had used their access to Guam's systems for any offensive attacks. ", "But, he added, that finding could point to a broader campaign to \"exfiltrate and farm data over the long term\",  in order to conduct sabotage operations in the future."]}